function Dsy() {
    this.Items = {};
}
Dsy.prototype.add = function (id, iArray) {
    this.Items[id] = iArray;
}
Dsy.prototype.Exists = function (id) {
    if (typeof (this.Items[id]) == "undefined") return false;
    return true;
}

function change1(v) {
    var str = "0";
    for (i = 0; i < v; i++) { str += ("_" + (document.getElementById(sprovcityid1[i]).selectedIndex - 1)); }
    ;
    var ss = document.getElementById(sprovcityid1[v]);
    if (ss == null)
        return;
    with (ss) {
        length = 0;
        options[0] = new Option(opt0[v], opt0[v]);
        if (v && document.getElementById(sprovcityid1[v - 1]).selectedIndex > 0 || !v) {
            if (dsy.Exists(str)) {
                ar = dsy.Items[str];
                for (i = 0; i < ar.length; i++) options[length] = new Option(ar[i], ar[i]);
                if (v) options[0].selected = true;
            }
        }
        if (++v < s1.length) { change1(v); }
    }
}

function change(v) {
    var str = "0";
    for (i = 0; i < v; i++) { str += ("_" + (document.getElementById(sprovcityid[i]).selectedIndex - 1)); }
    ;
    var ss = document.getElementById(sprovcityid[v]);
    if (ss == null)
        return;
    with (ss) {
        length = 0;
        options[0] = new Option(opt0[v], opt0[v]);
        if (v && document.getElementById(sprovcityid[v - 1]).selectedIndex > 0 || !v) {
            if (dsy.Exists(str)) {
                ar = dsy.Items[str];
                for (i = 0; i < ar.length; i++) options[length] = new Option(ar[i], ar[i]);
                if (v) options[0].selected = true;
            }
        }
        if (++v < s.length) { change(v); }
    }
}

function preselect1(p_key, c_key) {
    var index;

    var provinces = new Array("北京", "天津", "上海", "重庆", "河北", "山西", "内蒙古", "辽宁", "吉林", "黑龙江", "江苏", "浙江", "安徽", "福建", "江西", "山东", "河南", "湖北", "湖南", "广东", "广西", "海南", "四川", "贵州", "云南", "西藏", "陕西", "甘肃", "青海", "宁夏", "新疆", "香港", "澳门", "台湾");
    var cnt = provinces.length;
    //alert(cnt);
    for (i = 0; i < cnt; i++) {
        if (p_key == provinces[i]) {
            index = i;
            break;
        }
    }
    if (index < provinces.length) {
        document.getElementById(sprovcityid1[0]).selectedIndex = index + 1;
        change1(1);
    }
    document.getElementById(sprovcityid1[1]).value = c_key;
}


function preselect(p_key, c_key) {
    var index;

    var provinces = new Array("北京", "天津", "上海", "重庆", "河北", "山西", "内蒙古", "辽宁", "吉林", "黑龙江", "江苏", "浙江", "安徽", "福建", "江西", "山东", "河南", "湖北", "湖南", "广东", "广西", "海南", "四川", "贵州", "云南", "西藏", "陕西", "甘肃", "青海", "宁夏", "新疆", "香港", "澳门", "台湾");
    var cnt = provinces.length;
    //alert(cnt);
    for (i = 0; i < cnt; i++) {
        if (p_key == provinces[i]) {
            index = i;
            break;
        }
    }
    if (index < provinces.length) {
        document.getElementById(sprovcityid[0]).selectedIndex = index + 1;
        change(1);
    }
    document.getElementById(sprovcityid[1]).value = c_key;
}

var dsy = new Dsy();

dsy.add("0_0_0", []);
dsy.add("0_0", ["东城", "西城", "崇文", "宣武", "朝阳", "丰台", "石景山", "海淀", "门头沟", "房山", "通州", "顺义", "昌平", "大兴", "怀柔", "平谷", "密云", "延庆"]);
dsy.add("0_1_0", []);
dsy.add("0_1", ["和平", "河东", "河西", "南开", "河北", "红桥", "塘沽", "汉沽", "大港", "东丽", "西青", "津南", "北辰", "武清", "宝坻", "蓟县", "宁河", "静海"]);
dsy.add("0_2_0", []);
dsy.add("0_2", ["黄浦", "卢湾", "徐汇", "长宁", "静安", "普陀", "闸北", "虹口", "杨浦", "闵行", "宝山", "嘉定", "浦东新", "金山", "松江", "青浦", "南汇", "奉贤", "崇明"]);
dsy.add("0_3_0", []);
dsy.add("0_3", ["渝中", "大渡口", "江北", "沙坪坝", "九龙坡", "南岸", "北碚", "万盛", "双桥", "渝北", "巴南", "万州", "涪陵", "黔江", "长寿", "合川", "永川", "江津", "南川", "綦江", "潼南", "铜梁", "大足", "荣昌", "璧山", "垫江", "武隆", "丰都", "城口", "梁平", "开县", "巫溪", "巫山", "奉节", "云阳", "忠县", "石柱", "彭水", "酉阳", "秀山"]);
dsy.add("0_4_0", ["长安", "桥东", "桥西", "新华", "裕华", "井陉矿", "辛集", "藁城", "晋州", "新乐", "鹿泉", "井陉县", "微水镇", "正定县", "正定镇", "栾城县", "栾城镇", "行唐县", "龙州镇", "灵寿县", "灵寿镇", "高邑县", "高邑镇", "深泽县", "深泽镇", "赞皇县", "赞皇镇", "无极县", "无极镇", "平山县", "平山镇", "元氏县", "槐阳镇", "赵县", "赵州镇"]);
dsy.add("0_4_1", ["桥西", "桥东", "宣化", "下花园", "宣化县", "张家口市宣化", "张北县", "张北镇", "康保县", "康保镇", "沽源县", "平定堡镇", "尚义县", "南壕堑镇", "蔚县", "蔚州镇", "阳原县", "西城镇", "怀安县", "柴沟堡镇", "万全县", "孔家庄镇", "怀来县", "沙城镇", "涿鹿县", "涿鹿镇", "赤城县", "赤城镇", "崇礼县", "西湾子镇"]);
dsy.add("0_4_2", ["双桥", "双滦", "鹰手营子矿", "承德县", "下板城镇", "兴隆县", "兴隆镇", "平泉县", "平泉镇", "滦平县", "滦平镇", "隆化县", "隆化镇", "丰宁满族自治县", "大阁镇", "宽城满族自治县", "宽城镇", "围场满族蒙古族自治县", "围场镇"]);
dsy.add("0_4_3", ["海港", "山海关", "北戴河", "昌黎县", "昌黎镇", "抚宁县", "抚宁镇", "卢龙县", "卢龙镇", "青龙满族自治县", "青龙镇"]);
dsy.add("0_4_4", ["路北", "路南", "古冶", "开平", "丰润", "丰南", "遵化", "迁安", "滦县", "滦州镇", "滦南县", "倴城镇", "乐亭县", "乐亭镇", "迁西县", "兴城镇", "玉田县", "玉田镇", "唐海县", "唐海镇"]);
dsy.add("0_4_5", ["安次", "广阳", "霸州", "三河", "固安县", "固安镇", "永清县", "永清镇", "香河县", "淑阳镇", "大城县", "平舒镇", "文安县", "文安镇", "大厂回族自治县", "大厂镇"]);
dsy.add("0_4_6", ["新", "北", "南", "定州", "涿州", "安国", "高碑店", "满城县", "满城镇", "清苑县", "清苑镇", "易县", "易州镇", "徐水县", "安肃镇", "涞源县", "涞源镇", "定兴县", "定兴镇", "顺平县", "蒲阳镇", "唐县", "仁厚镇", "望都县", "望都镇", "涞水县", "涞水镇", "高阳县", "高阳镇", "安新县", "安新镇", "雄县", "雄州镇", "容城县", "容城镇", "曲阳县", "恒州镇", "阜平县", "阜平镇", "博野县", "博陵镇", "蠡县", "蠡吾镇"]);
dsy.add("0_4_7", ["桃城", "冀州", "深州", "枣强县", "枣强镇", "武邑县", "武邑镇", "武强县", "武强镇", "饶阳县", "饶阳镇", "安平县", "安平镇", "故城县", "郑口镇", "景县", "景州镇", "阜城县", "阜城镇"]);
dsy.add("0_4_8", ["运河", "新华", "泊头", "任丘", "黄骅", "河间", "沧县", "沧州市新华", "青县", "清州镇", "东光县", "东光镇", "海兴县", "苏基镇", "盐山县", "盐山镇", "肃宁县", "肃宁镇", "南皮县", "南皮镇", "吴桥县", "桑园镇", "献县", "乐寿镇", "孟村回族自治县", "孟村镇"]);
dsy.add("0_4_9", ["桥东", "桥西", "南宫", "沙河", "邢台县", "邢台市桥东", "临城县", "临城镇", "内丘县", "内丘镇", "柏乡县", "柏乡镇", "隆尧县", "隆尧镇", "任县", "任城镇", "南和县", "和阳镇", "宁晋县", "凤凰镇", "巨鹿县", "巨鹿镇", "新河县", "新河镇", "广宗县", "广宗镇", "平乡县", "丰州镇", "威县", "洺州镇", "清河县", "葛仙庄镇", "临西县", "临西镇"]);
dsy.add("0_4_10", ["丛台", "邯山", "复兴", "峰峰矿", "武安", "邯郸县", "南堡乡东小屯村", "临漳县", "临漳镇", "成安县", "成安镇", "大名县", "大名镇", "涉县", "涉城镇", "磁县", "磁州镇", "肥乡县", "肥乡镇", "永年县", "临洺关镇", "邱县", "新马头镇", "鸡泽县", "鸡泽镇", "广平县", "广平镇", "馆陶县", "馆陶镇", "魏县", "魏城镇", "曲周县", "曲周镇"]);
dsy.add("0_4", ["石家庄", "张家口", "承德", "秦皇岛", "唐山", "廊坊", "保定", "衡水", "沧州", "邢台", "邯郸"]);
dsy.add("0_5_0", ["杏花岭", "小店", "迎泽", "尖草坪", "万柏林", "晋源", "古交", "清徐县", "清源镇", "阳曲县", "黄寨镇", "娄烦县", "娄烦镇"]);
dsy.add("0_5_1", ["朔城", "平鲁", "山阴县", "岱岳乡", "应县", "金城镇", "右玉县", "新城镇", "怀仁县", "云中镇"]);
dsy.add("0_5_2", ["城", "矿", "南郊", "新荣", "阳高县", "龙泉镇", "天镇县", "玉泉镇", "广灵县", "壶泉镇", "灵丘县", "武灵镇", "浑源县", "永安镇", "左云县", "云兴镇", "大同县", "西坪镇"]);
dsy.add("0_5_3", ["城", "矿", "郊", "平定县", "冠山镇", "盂县", "秀水镇"]);
dsy.add("0_5_4", ["城", "郊", "潞城", "长治县", "韩店镇", "襄垣县", "古韩镇", "屯留县", "麟绛镇", "平顺县", "青羊镇", "黎城县", "黎侯镇", "壶关县", "龙泉镇", "长子县", "丹朱镇", "武乡县", "丰州镇", "沁县", "定昌镇", "沁源县", "沁河镇"]);
dsy.add("0_5_5", ["城", "高平", "泽州县", "南村镇", "沁水县", "龙港镇", "阳城县", "凤城镇", "陵川县", "崇文镇"]);
dsy.add("0_5_6", ["忻府", "原平", "定襄县", "晋昌镇", "五台县", "台城镇", "代县", "上馆镇", "繁峙县", "繁城镇", "宁武县", "凤凰镇", "静乐县", "鹅城镇", "神池县", "龙泉镇", "五寨县", "砚城镇", "岢岚县", "岚漪镇", "河曲县", "文笔镇", "保德县", "东关镇", "偏关县", "新关镇"]);
dsy.add("0_5_7", ["榆次", "介休", "榆社县", "箕城镇", "左权县", "辽阳镇", "和顺县", "义兴镇", "昔阳县", "乐平镇", "寿阳县", "朝阳镇", "太谷县", "明星镇", "祁县", "昭余镇", "平遥县", "古陶镇", "灵石县", "翠峰镇"]);
dsy.add("0_5_8", ["尧都", "侯马", "霍州", "曲沃县", "乐昌镇", "翼城县", "唐兴镇", "襄汾县", "新城镇", "洪洞县", "大槐树镇", "古县", "岳阳镇", "安泽县", "府城镇", "浮山县", "天坛镇", "吉县", "吉昌镇", "乡宁县", "昌宁镇", "蒲县", "蒲城镇", "大宁县", "昕水镇", "永和县", "芝河镇", "隰县", "龙泉镇", "汾西县", "永安镇"]);
dsy.add("0_5_9", ["离石", "孝义", "汾阳", "文水县", "凤城镇", "中阳县", "宁乡镇", "兴县", "蔚汾镇", "临县", "临泉镇", "方山县", "圪洞镇", "柳林县", "柳林镇", "岚县", "东村镇", "交口县", "水头镇", "交城县", "天宁镇", "石楼县", "灵泉镇"]);
dsy.add("0_5_10", ["盐湖", "永济", "河津", "芮城县", "古魏镇", "临猗县", "猗氏镇", "万荣县", "解店镇", "新绛县", "龙兴镇", "稷山县", "稷峰镇", "闻喜县", "桐城镇", "夏县", "瑶峰镇", "绛县", "古绛镇", "平陆县", "圣人涧镇", "垣曲县", "新城镇"]);
dsy.add("0_5", ["太原", "朔州", "大同", "阳泉", "长治", "晋城", "忻州", "晋中", "临汾", "吕梁", "运城"]);
dsy.add("0_6_0", ["回民", "新城", "玉泉", "赛罕", "托克托县", "双河镇", "武川县", "可可以力更镇", "和林格尔县", "城关镇", "清水河县", "城关镇", "土默特左旗", "察素齐镇"]);
dsy.add("0_6_1", ["昆都仑", "东河", "青山", "石拐", "白云矿", "九原", "固阳县", "金山镇", "土默特右旗", "萨拉齐镇", "达尔罕茂明安联合旗", "百灵庙镇"]);
dsy.add("0_6_2", ["海勃湾", "海南", "乌达"]);
dsy.add("0_6_3", ["红山", "元宝山", "松山", "宁城县", "天义镇", "林西县", "林西镇", "阿鲁科尔沁旗", "天山镇", "巴林左旗", "林东镇", "巴林右旗", "大板镇", "克什克腾旗", "经棚镇", "翁牛特旗", "乌丹镇", "喀喇沁旗", "锦山镇", "敖汉旗", "新惠镇"]);
dsy.add("0_6_4", ["科尔沁", "霍林郭勒", "开鲁县", "开鲁镇", "库伦旗", "库伦镇", "奈曼旗", "大沁他拉镇", "扎鲁特旗", "鲁北镇", "科尔沁左翼中旗", "保康镇", "科尔沁左翼后旗", "甘旗卡镇"]);
dsy.add("0_6_5", ["海拉尔", "满洲里", "扎兰屯", "牙克石", "根河", "额尔古纳", "阿荣旗", "那吉镇", "新巴尔虎右旗", "阿拉坦额莫勒镇", "新巴尔虎左旗", "阿穆古郎镇", "陈巴尔虎旗", "巴彦库仁镇", "鄂伦春自治旗", "阿里河镇", "鄂温克族自治旗", "巴彦托海镇", "莫力达瓦达斡尔族自治旗", "尼尔基镇"]);
dsy.add("0_6_6", ["东胜", "达拉特旗", "树林召镇", "准格尔旗", "薛家湾镇", "鄂托克前旗", "敖勒召其镇", "鄂托克旗", "乌兰镇", "杭锦旗", "锡尼镇", "乌审旗", "嘎鲁图镇", "伊金霍洛旗", "阿勒腾席热镇"]);
dsy.add("0_6_7", ["集宁", "丰镇", "卓资县", "卓资山镇", "化德县", "长顺镇", "商都县", "商都镇", "兴和县", "城关镇", "凉城县", "岱海镇", "察哈尔右翼前旗", "土贵乌拉镇", "察哈尔右翼中旗", "科布尔镇", "察哈尔右翼后旗", "白音察干镇", "四子王旗", "乌兰花镇"]);
dsy.add("0_6_8", ["临河", "五原县", "隆兴昌镇", "磴口县", "巴彦高勒镇", "乌拉特前旗", "乌拉山镇", "乌拉特中旗", "海流图镇", "乌拉特后旗", "巴音宝力格镇", "杭锦后旗", "陕坝镇"]);
dsy.add("0_6_9", ["乌兰浩特", "阿尔山", "突泉县", "突泉镇", "科尔沁右翼前旗", "大坝沟镇", "科尔沁右翼中旗", "巴彦呼硕镇", "扎赉特旗", "音德尔镇"]);
dsy.add("0_6_10", ["锡林浩特", "二连浩特", "多伦县", "多伦淖尔镇", "阿巴嘎旗", "别力古台镇", "苏尼特左旗", "满都拉图镇", "苏尼特右旗", "赛汉塔拉镇", "东乌珠穆沁旗", "乌里雅斯太镇", "西乌珠穆沁旗", "巴拉嘎尔郭勒镇", "太仆寺旗", "宝昌镇", "镶黄旗", "新宝拉格镇", "正镶白旗", "明安图镇", "正蓝旗", "上都镇"]);
dsy.add("0_6_11", ["巴彦浩特镇", "阿拉善右旗", "额肯呼都格镇", "额济纳旗", "达来呼布镇"]);
dsy.add("0_6", ["呼和浩特", "包头", "乌海", "赤峰", "通辽", "呼伦贝尔", "鄂尔多斯", "乌兰察布", "巴彦淖尔", "兴安盟", "锡林郭勒盟", "阿拉善盟"]);
dsy.add("0_7_0", ["沈河", "和平", "大东", "皇姑", "铁西", "苏家屯", "东陵", "新城子", "于洪", "新民", "辽中县", "辽中镇", "康平县", "康平镇", "法库县", "法库镇"]);
dsy.add("0_7_1", ["双塔", "龙城", "北票", "凌源", "朝阳县", "朝阳市双塔", "建平县", "喀喇沁左翼蒙古族自治县", "大城子镇"]);
dsy.add("0_7_2", ["海州", "新邱", "太平", "清河门", "细河", "彰武县", "彰武镇", "阜新蒙古族自治县", "阜新镇"]);
dsy.add("0_7_3", ["银州", "清河", "调兵山", "开原", "铁岭县", "铁岭市银州", "西丰县", "西丰镇", "昌图县", "昌图镇"]);
dsy.add("0_7_4", ["顺城", "新抚", "东洲", "望花", "抚顺县", "抚顺市顺城", "新宾满族自治县", "新宾镇", "清原满族自治县", "清原镇"]);
dsy.add("0_7_5", ["平山", "溪湖", "明山", "南芬", "本溪满族自治县", "小市镇", "桓仁满族自治县", "桓仁镇"]);
dsy.add("0_7_6", ["白塔", "文圣", "宏伟", "弓长岭", "太子河", "灯塔", "辽阳县", "首山镇"]);
dsy.add("0_7_7", ["铁东", "铁西", "立山", "千山", "海城", "台安县", "台安镇", "岫岩满族自治县", "岫岩镇"]);
dsy.add("0_7_8", ["振兴", "元宝", "振安", "凤城", "东港", "宽甸满族自治县", "宽甸镇"]);
dsy.add("0_7_9", ["西岗", "中山", "沙河口", "甘井子", "旅顺口", "金州", "瓦房店", "普兰店", "庄河", "长海县", "大长山岛镇"]);
dsy.add("0_7_10", ["站前", "西", "鲅鱼圈", "老边", "大石桥", "盖州"]);
dsy.add("0_7_11", ["兴隆台", "双台子", "大洼县", "大洼镇", "盘山县", "盘锦市双台子"]);
dsy.add("0_7_12", ["太和", "古塔", "凌河", "凌海", "北宁", "黑山县", "黑山镇", "义县", "义州镇"]);
dsy.add("0_7_13", ["龙港", "连山", "南票", "兴城", "绥中县", "绥中镇", "建昌县", "建昌镇"]);
dsy.add("0_7", ["沈阳", "朝阳", "阜新", "铁岭", "抚顺", "本溪", "辽阳", "鞍山", "丹东", "大连", "营口", "盘锦", "锦州", "葫芦岛"]);
dsy.add("0_8_0", ["朝阳", "南关", "宽城", "二道", "绿园", "双阳", "德惠", "九台", "榆树", "农安县", "农安镇"]);
dsy.add("0_8_1", ["洮北", "大安", "洮南", "镇赉县", "镇赉镇", "通榆县", "开通镇"]);
dsy.add("0_8_2", ["宁江", "扶余县", "三岔河镇", "长岭县", "长岭镇", "乾安县", "乾安镇", "前郭尔罗斯蒙古族自治县", "前郭镇"]);
dsy.add("0_8_3", ["船营", "龙潭", "昌邑", "丰满", "磐石", "蛟河", "桦甸", "舒兰", "永吉县", "口前镇"]);
dsy.add("0_8_4", ["铁西", "铁东", "双辽", "公主岭", "梨树县", "梨树镇", "伊通满族自治县", "伊通镇"]);
dsy.add("0_8_5", ["龙山", "西安", "东丰县", "东丰镇", "东辽县", "白泉镇"]);
dsy.add("0_8_6", ["东昌", "二道江", "梅河口", "集安", "通化县", "快大茂镇", "辉南县", "朝阳镇", "柳河县", "柳河镇"]);
dsy.add("0_8_7", ["八道江", "临江", "江源县", "孙家堡子镇", "抚松县", "抚松镇", "靖宇县", "靖宇镇", "长白朝鲜族自治县", "长白镇"]);
dsy.add("0_8_8", ["延吉", "图们", "敦化", "珲春", "龙井", "和龙", "汪清县", "汪清镇", "安图县", "明月镇"]);
dsy.add("0_8", ["长春", "白城", "松原", "吉林", "四平", "辽源", "通化", "白山", "延边州"]);
dsy.add("0_9_0", ["松北", "道里", "南岗", "道外", "香坊", "动力", "平房", "呼兰", "双城", "尚志", "五常", "阿城", "依兰县", "依兰镇", "方正县", "方正镇", "宾县", "宾州镇", "巴彦县", "巴彦镇", "木兰县", "木兰镇", "通河县", "通河镇", "延寿县", "延寿镇"]);
dsy.add("0_9_1", ["建华", "龙沙", "铁锋", "昂昂溪", "富拉尔基", "碾子山", "梅里斯达斡尔族", "讷河", "龙江县", "龙江镇", "依安县", "依安镇", "泰来县", "泰来镇", "甘南县", "甘南镇", "富裕县", "富裕镇", "克山县", "克山镇", "克东县", "克东镇", "拜泉县", "拜泉镇"]);
dsy.add("0_9_2", ["桃山", "新兴", "茄子河", "勃利县", "勃利镇"]);
dsy.add("0_9_3", ["爱辉", "北安", "五大连池", "嫩江县", "嫩江镇", "逊克县", "边疆镇", "孙吴县", "孙吴镇"]);
dsy.add("0_9_4", ["萨尔图", "龙凤", "让胡路", "大同", "红岗", "肇州县", "肇州镇", "肇源县", "肇源镇", "林甸县", "林甸镇", "杜尔伯特蒙古族自治县", "泰康镇"]);
dsy.add("0_9_5", ["兴山", "向阳", "工农", "南山", "兴安", "东山", "萝北县", "凤翔镇", "绥滨县", "绥滨镇"]);
dsy.add("0_9_6", ["伊春", "南岔", "友好", "西林", "翠峦", "新青", "美溪", "金山屯", "五营", "乌马河", "汤旺河", "带岭", "乌伊岭", "红星", "上甘岭", "铁力", "嘉荫县", "朝阳镇"]);
dsy.add("0_9_7", ["前进", "永红", "向阳", "东风", "郊", "同江", "富锦", "桦南县", "桦南镇", "桦川县", "悦来镇", "汤原县", "汤原镇", "抚远县", "抚远镇"]);
dsy.add("0_9_8", ["尖山", "岭东", "四方台", "宝山", "集贤县", "福利镇", "友谊县", "友谊镇", "宝清县", "宝清镇", "饶河县", "饶河镇"]);
dsy.add("0_9_9", ["鸡冠", "恒山", "滴道", "梨树", "城子河", "麻山", "虎林", "密山", "鸡东县", "鸡东镇"]);
dsy.add("0_9_10", ["爱民", "东安", "阳明", "西安", "穆棱", "绥芬河", "海林", "宁安", "东宁县", "东宁镇", "林口县", "林口镇"]);
dsy.add("0_9_11", ["北林", "安达", "肇东", "海伦", "望奎县", "望奎镇", "兰西县", "兰西镇", "青冈县", "青冈镇", "庆安县", "庆安镇", "明水县", "明水镇", "绥棱县", "绥棱镇"]);
dsy.add("0_9_12", ["呼玛县", "呼玛镇", "塔河县", "塔河镇", "漠河县", "西林吉镇"]);
dsy.add("0_9", ["哈尔滨", "齐齐哈尔", "七台河", "黑河", "大庆", "鹤岗", "伊春", "佳木斯", "双鸭山", "鸡西", "牡丹江", "绥化", "大兴安岭地"]);
dsy.add("0_10_0", ["玄武", "白下", "秦淮", "建邺", "鼓楼", "下关", "浦口", "六合", "栖霞", "雨花台", "江宁", "溧水县", "永阳镇", "高淳县", "淳溪镇"]);
dsy.add("0_10_1", ["云龙", "鼓楼", "九里", "贾汪", "泉山", "邳州", "新沂", "铜山县", "铜山镇", "睢宁县", "睢城镇", "沛县", "沛城镇", "丰县", "凤城镇"]);
dsy.add("0_10_2", ["新浦", "连云", "海州", "赣榆县", "青口镇", "灌云县", "伊山镇", "东海县", "牛山镇", "灌南县", "新安镇"]);
dsy.add("0_10_3", ["宿城", "宿豫", "沭阳县", "沭城镇", "泗阳县", "众兴镇", "泗洪县", "青阳镇"]);
dsy.add("0_10_4", ["清河", "清浦", "楚州", "淮阴", "金湖县", "黎城镇", "盱眙县", "盱城镇", "洪泽县", "高良涧镇", "涟水县", "涟城镇"]);
dsy.add("0_10_5", ["亭湖", "盐都", "东台", "大丰", "射阳县", "合德镇", "阜宁县", "阜城镇", "滨海县", "东坎镇", "响水县", "响水镇", "建湖县", "近湖镇"]);
dsy.add("0_10_6", ["维扬", "广陵", "邗江", "仪征", "江都", "高邮", "宝应县", "安宜镇"]);
dsy.add("0_10_7", ["海陵", "高港", "靖江", "泰兴", "姜堰", "兴化"]);
dsy.add("0_10_8", ["崇川", "港闸", "海门", "启东", "通州", "如皋", "如东县", "掘港镇", "海安县", "海安镇"]);
dsy.add("0_10_9", ["京口", "润州", "丹徒", "扬中", "丹阳", "句容"]);
dsy.add("0_10_10", ["钟楼", "天宁", "戚墅堰", "新北", "武进", "金坛", "溧阳"]);
dsy.add("0_10_11", ["崇安", "南长", "北塘", "滨湖", "惠山", "锡山", "江阴", "宜兴"]);
dsy.add("0_10_12", ["金阊", "沧浪", "平江", "虎丘", "吴中", "相城", "吴江", "昆山", "太仓", "常熟", "张家港"]);
dsy.add("0_10", ["南京", "徐州", "连云港", "宿迁", "淮安", "盐城", "扬州", "泰州", "南通", "镇江", "常州", "无锡", "苏州"]);
dsy.add("0_11_0", ["拱墅", "上城", "下城", "江干", "西湖", "滨江", "余杭", "萧山", "临安", "富阳", "建德", "桐庐县", "淳安县", "千岛湖镇"]);
dsy.add("0_11_1", ["吴兴", "南浔", "长兴县", "雉城镇", "德清县", "武康镇", "安吉县", "递铺镇"]);
dsy.add("0_11_2", ["南湖", "秀洲", "平湖", "海宁", "桐乡", "嘉善县", "魏塘镇", "海盐县", "武原镇"]);
dsy.add("0_11_3", ["定海", "普陀", "岱山县", "高亭镇", "嵊泗县", "菜园镇"]);
dsy.add("0_11_4", ["海曙", "江东", "江北", "北仑", "镇海", "鄞州", "慈溪", "余姚", "奉化", "宁海县", "象山县"]);
dsy.add("0_11_5", ["越城", "诸暨", "上虞", "嵊州", "绍兴县", "新昌县", "城关镇"]);
dsy.add("0_11_6", ["柯城", "衢江", "江山", "常山县", "天马镇", "开化县", "城关镇", "龙游县"]);
dsy.add("0_11_7", ["婺城", "金东", "兰溪", "永康", "义乌", "东阳", "武义县", "浦江县", "磐安县", "安文镇"]);
dsy.add("0_11_8", ["椒江", "黄岩", "路桥", "临海", "温岭", "三门县", "海游镇", "天台县", "仙居县", "玉环县", "珠港镇"]);
dsy.add("0_11_9", ["鹿城", "龙湾", "瓯海", "瑞安", "乐清", "永嘉县", "上塘镇", "文成县", "大峃镇", "平阳县", "昆阳镇", "泰顺县", "罗阳镇", "洞头县", "北岙镇", "苍南县", "灵溪镇"]);
dsy.add("0_11_10", ["莲都", "龙泉", "缙云县", "五云镇", "青田县", "鹤城镇", "云和县", "云和镇", "遂昌县", "妙高镇", "松阳县", "西屏镇", "庆元县", "松源镇", "景宁畲族自治县", "鹤溪镇"]);
dsy.add("0_11", ["杭州", "湖州", "嘉兴", "舟山", "宁波", "绍兴", "衢州", "金华", "台州", "温州", "丽水"]);
dsy.add("0_12_0", ["庐阳", "瑶海", "蜀山", "包河", "长丰县", "水湖镇", "肥东县", "店埠镇", "肥西县", "上派镇"]);
dsy.add("0_12_1", ["埇桥", "砀山县", "砀城镇", "萧县", "龙城镇", "灵璧县", "灵城镇", "泗县", "泗城镇"]);
dsy.add("0_12_2", ["相山", "杜集", "烈山", "濉溪县", "濉溪镇"]);
dsy.add("0_12_3", ["谯城", "涡阳县", "城关镇", "蒙城县", "城关镇", "利辛县", "城关镇"]);
dsy.add("0_12_4", ["颍州", "颍东", "颍泉", "界首", "临泉县", "城关镇", "太和县", "城关镇", "阜南县", "城关镇", "颍上县", "慎城镇"]);
dsy.add("0_12_5", ["蚌山", "龙子湖", "禹会", "淮上", "怀远县", "城关镇", "五河县", "城关镇", "固镇县", "城关镇"]);
dsy.add("0_12_6", ["田家庵", "大通", "谢家集", "八公山", "潘集", "凤台县", "城关镇"]);
dsy.add("0_12_7", ["琅", "南谯", "明光", "天长", "来安县", "新安镇", "全椒县", "襄河镇", "定远县", "定城镇", "凤阳县", "府城镇"]);
dsy.add("0_12_8", ["雨山", "花山", "金家庄", "当涂县", "姑孰镇"]);
dsy.add("0_12_9", ["镜湖", "弋江", "三山", "鸠江", "芜湖县", "湾镇", "繁昌县", "繁阳镇", "南陵县", "籍山镇"]);
dsy.add("0_12_10", ["铜官山", "狮子山", "郊", "铜陵县", "五松镇"]);
dsy.add("0_12_11", ["迎江", "大观", "宜秀", "桐城", "怀宁县", "高河镇", "枞阳县", "枞阳镇", "潜山县", "梅城镇", "太湖县", "晋熙镇", "宿松县", "孚玉镇", "望江县", "雷阳镇", "岳西县", "天堂镇"]);
dsy.add("0_12_12", ["屯溪", "黄山", "徽州", "歙县", "徽城镇", "休宁县", "海阳镇", "黟县", "碧阳镇", "祁门县", "祁山镇"]);
dsy.add("0_12_13", ["金安", "裕安", "寿县", "寿春镇", "霍邱县", "城关镇", "舒城县", "城关镇", "金寨县", "梅山镇", "霍山县", "衡山镇"]);
dsy.add("0_12_14", ["居巢", "庐江县", "庐城镇", "无为县", "无城镇", "含山县", "环峰镇", "和县", "历阳镇"]);
dsy.add("0_12_15", ["贵池", "东至县", "尧渡镇", "石台县", "七里镇", "青阳县", "蓉城镇"]);
dsy.add("0_12_16", ["宣州", "宁国", "郎溪县", "建平镇", "广德县", "桃州镇", "泾县", "泾川镇", "旌德县", "旌阳镇", "绩溪县", "华阳镇"]);
dsy.add("0_12", ["合肥", "宿州", "淮北", "亳州", "阜阳", "蚌埠", "淮南", "滁州", "马鞍山", "芜湖", "铜陵", "安庆", "黄山", "六安", "巢湖", "池州", "宣城"]);
dsy.add("0_13_0", ["鼓楼", "台江", "仓山", "马尾", "晋安", "福清", "长乐", "闽侯县", "连江县", "凤城镇", "罗源县", "凤山镇", "闽清县", "梅城镇", "永泰县", "樟城镇", "平潭县", "潭城镇"]);
dsy.add("0_13_1", ["延平", "邵武", "武夷山", "建瓯", "建阳", "顺昌县", "浦城县", "光泽县", "杭川镇", "松溪县", "松源镇", "政和县", "熊山镇"]);
dsy.add("0_13_2", ["城厢", "涵江", "荔城", "秀屿", "仙游县"]);
dsy.add("0_13_3", ["梅列", "三元", "永安", "明溪县", "雪峰镇", "清流县", "龙津镇", "宁化县", "翠江镇", "大田县", "均溪镇", "尤溪县", "城关镇", "沙县", "将乐县", "古镛镇", "泰宁县", "杉城镇", "建宁县", "濉城镇"]);
dsy.add("0_13_4", ["鲤城", "丰泽", "洛江", "泉港", "石狮", "晋江", "南安", "惠安县", "螺城镇", "安溪县", "凤城镇", "永春县", "桃城镇", "德化县", "浔中镇", "金门县", "☆"]);
dsy.add("0_13_5", ["思明", "海沧", "湖里", "集美", "同安", "翔安"]);
dsy.add("0_13_6", ["芗城", "龙文", "龙海", "云霄县", "云陵镇", "漳浦县", "绥安镇", "诏安县", "南诏镇", "长泰县", "武安镇", "东山县", "西埔镇", "南靖县", "山城镇", "平和县", "小溪镇", "华安县", "华丰镇"]);
dsy.add("0_13_7", ["新罗", "漳平", "长汀县", "汀州镇", "永定县", "凤城镇", "上杭县", "临江镇", "武平县", "平川镇", "连城县", "莲峰镇"]);
dsy.add("0_13_8", ["蕉城", "福安", "福鼎", "寿宁县", "鳌阳镇", "霞浦县", "柘荣县", "双城镇", "屏南县", "古峰镇", "古田县", "周宁县", "狮城镇"]);
dsy.add("0_13", ["福州", "南平", "莆田", "三明", "泉州", "厦门", "漳州", "龙岩", "宁德"]);
dsy.add("0_14_0", ["东湖", "西湖", "青云谱", "湾里", "青山湖", "南昌县", "莲塘镇", "新建县", "长堎镇", "安义县", "龙津镇", "进贤县", "民和镇"]);
dsy.add("0_14_1", ["浔阳", "庐山", "瑞昌", "九江县", "沙河街镇", "武宁县", "新宁镇", "修水县", "义宁镇", "永修县", "涂埠镇", "德安县", "蒲亭镇", "星子县", "南康镇", "都昌县", "都昌镇", "湖口县", "双钟镇", "彭泽县", "龙城镇"]);
dsy.add("0_14_2", ["珠山", "昌江", "乐平", "浮梁县", "浮梁镇"]);
dsy.add("0_14_3", ["月湖", "贵溪", "余江县", "邓埠镇"]);
dsy.add("0_14_4", ["渝水", "分宜县", "分宜镇"]);
dsy.add("0_14_5", ["安源", "湘东", "莲花县", "琴亭镇", "上栗县", "上栗镇", "芦溪县", "芦溪镇"]);
dsy.add("0_14_6", ["章贡", "瑞金", "南康", "赣县", "梅林镇", "信丰县", "嘉定镇", "大余县", "南安镇", "上犹县", "东山镇", "崇义县", "横水镇", "安远县", "欣山镇", "龙南县", "龙南镇", "定南县", "历市镇", "全南县", "城厢镇", "宁都县", "梅江镇", "于都县", "贡江镇", "兴国县", "潋江镇", "会昌县", "文武坝镇", "寻乌县", "长宁镇", "石城县", "琴江镇"]);
dsy.add("0_14_7", ["信州", "德兴", "上饶县", "旭日镇", "广丰县", "永丰镇", "玉山县", "冰溪镇", "铅山县", "河口镇", "横峰县", "岑阳镇", "弋阳县", "弋江镇", "余干县", "玉亭镇", "鄱阳县", "鄱阳镇", "万年县", "陈营镇", "婺源县", "紫阳镇"]);
dsy.add("0_14_8", ["临川", "南城县", "建昌镇", "黎川县", "日峰镇", "南丰县", "琴城镇", "崇仁县", "巴山镇", "乐安县", "鳌溪镇", "宜黄县", "凤冈镇", "金溪县", "秀谷镇", "资溪县", "鹤城镇", "东乡县", "孝岗镇", "广昌县", "旴江镇"]);
dsy.add("0_14_9", ["袁州", "丰城", "樟树", "高安", "奉新县", "冯川镇", "万载县", "上高县", "宜丰县", "新昌镇", "靖安县", "双溪镇", "铜鼓县", "永宁镇"]);
dsy.add("0_14_10", ["吉州", "青原", "井冈山", "厦坪镇", "吉安县", "敦厚镇", "吉水县", "文峰镇", "峡江县", "水边镇", "新干县", "金川镇", "永丰县", "恩江镇", "泰和县", "澄江镇", "遂川县", "泉江镇", "万安县", "芙蓉镇", "安福县", "平都镇", "永新县", "禾川镇"]);
dsy.add("0_14", ["南昌", "九江", "景德镇", "鹰潭", "新余", "萍乡", "赣州", "上饶", "抚州", "宜春", "吉安"]);
dsy.add("0_15_0", ["市中", "历下", "槐荫", "天桥", "历城", "长清", "章丘", "平阴县", "平阴镇", "济阳县", "济阳镇", "商河县"]);
dsy.add("0_15_1", ["市南", "市北", "四方", "黄岛", "崂山", "城阳", "李沧", "胶州", "即墨", "平度", "胶南", "莱西"]);
dsy.add("0_15_2", ["东昌府", "临清", "阳谷县", "莘县", "茌平县", "东阿县", "冠县", "冠城镇", "高唐县"]);
dsy.add("0_15_3", ["德城", "乐陵", "禹城", "陵县", "陵城镇", "平原县", "夏津县", "夏津镇", "武城县", "武城镇", "齐河县", "晏城镇", "临邑县", "宁津县", "宁津镇", "庆云县", "庆云镇"]);
dsy.add("0_15_4", ["东营", "河口", "垦利县", "垦利镇", "利津县", "利津镇", "广饶县", "广饶镇"]);
dsy.add("0_15_5", ["张店", "淄川", "博山", "临淄", "周村", "桓台县", "索镇", "高青县", "田镇", "沂源县", "南麻镇"]);
dsy.add("0_15_6", ["潍城", "寒亭", "坊子", "奎文", "安丘", "昌邑", "高密", "青州", "诸城", "寿光", "临朐县", "昌乐县"]);
dsy.add("0_15_7", ["莱山", "芝罘", "福山", "牟平", "栖霞", "海阳", "龙口", "莱阳", "莱州", "蓬莱", "招远", "长岛县", "南长山镇"]);
dsy.add("0_15_8", ["环翠", "荣成", "乳山", "文登"]);
dsy.add("0_15_9", ["东港", "岚山", "五莲县", "洪凝镇", "莒县", "城阳镇"]);
dsy.add("0_15_10", ["兰山", "罗庄", "河东", "郯城县", "郯城镇", "苍山县", "卞庄镇", "莒南县", "十字路镇", "沂水县", "沂水镇", "蒙阴县", "蒙阴镇", "平邑县", "平邑镇", "费县", "费城镇", "沂南县", "界湖镇", "临沭县", "临沭镇"]);
dsy.add("0_15_11", ["薛城", "市中", "峄城", "台儿庄", "山亭", "滕州"]);
dsy.add("0_15_12", ["市中", "任城", "曲阜", "兖州", "邹城", "微山县", "鱼台县", "谷亭镇", "金乡县", "金乡镇", "嘉祥县", "嘉祥镇", "汶上县", "汶上镇", "泗水县", "梁山县", "梁山镇"]);
dsy.add("0_15_13", ["泰山", "岱岳", "新泰", "肥城", "宁阳县", "宁阳镇", "东平县", "东平镇"]);
dsy.add("0_15_14", ["莱城", "钢城"]);
dsy.add("0_15_15", ["滨城", "惠民县", "惠民镇", "阳信县", "阳信镇", "无棣县", "无棣镇", "沾化县", "富国镇", "博兴县", "博兴镇", "邹平县"]);
dsy.add("0_15_16", ["牡丹", "曹县", "曹城镇", "定陶县", "定陶镇", "成武县", "成武镇", "单县", "单城镇", "巨野县", "巨野镇", "郓城县", "郓城镇", "鄄城县", "鄄城镇", "东明县", "城关镇"]);
dsy.add("0_15", ["济南", "青岛", "聊城", "德州", "东营", "淄博", "潍坊", "烟台", "威海", "日照", "临沂", "枣庄", "济宁", "泰安", "莱芜", "滨州", "菏泽"]);
dsy.add("0_16_0", ["中原", "二七", "管城回族", "金水", "上街", "惠济", "新郑", "登封", "新密", "巩义", "荥阳", "中牟县", "城关镇"]);
dsy.add("0_16_1", ["鼓楼", "龙亭", "顺河回族", "禹王台", "金明", "杞县", "城关镇", "通许县", "城关镇", "尉氏县", "城关镇", "开封县", "城关镇", "兰考县", "城关镇"]);
dsy.add("0_16_2", ["湖滨", "义马", "灵宝", "渑池县", "城关镇", "陕县", "大营镇", "卢氏县", "城关镇"]);
dsy.add("0_16_3", ["西工", "老城", "瀍河回族", "涧西", "吉利", "洛龙", "偃师", "孟津县", "城关镇", "新安县", "城关镇", "栾川县", "城关镇", "嵩县", "城关镇", "汝阳县", "城关镇", "宜阳县", "城关镇", "洛宁县", "城关镇", "伊川县", "城关镇"]);
dsy.add("0_16_4", ["解放", "山阳", "中站", "马村", "孟州", "沁阳", "修武县", "城关镇", "博爱县", "清化镇", "武陟县", "木城镇", "温县", "温泉镇"]);
dsy.add("0_16_5", ["卫滨", "红旗", "凤泉", "牧野", "卫辉", "辉县", "新乡县", "新乡市红旗", "获嘉县", "城关镇", "原阳县", "城关镇", "延津县", "城关镇", "封丘县", "城关镇", "长垣县", "城关镇"]);
dsy.add("0_16_6", ["淇滨", "山城", "鹤山", "浚县", "城关镇", "淇县", "朝歌镇"]);
dsy.add("0_16_7", ["北关", "文峰", "殷都", "龙安", "林州", "安阳县", "安阳市北关", "汤阴县", "城关镇", "滑县", "道口镇", "内黄县", "城关镇"]);
dsy.add("0_16_8", ["华龙", "清丰县", "城关镇", "南乐县", "城关镇", "范县", "城关镇", "台前县", "城关镇", "濮阳县", "城关镇"]);
dsy.add("0_16_9", ["梁园", "睢阳", "永城", "虞城县", "城关镇", "民权县", "城关镇", "宁陵县", "城关镇", "睢县", "城关镇", "夏邑县", "城关镇", "柘城县", "城关镇"]);
dsy.add("0_16_10", ["魏都", "禹州", "长葛", "许昌县", "许昌市魏都", "鄢陵县", "安陵镇", "襄城县", "城关镇"]);
dsy.add("0_16_11", ["源汇", "郾城", "召陵", "舞阳县", "舞泉镇", "临颍县", "城关镇"]);
dsy.add("0_16_12", ["新华", "卫东", "湛河", "石龙", "舞钢", "汝州", "宝丰县", "城关镇", "叶县", "昆阳镇", "鲁山县", "鲁阳镇", "郏县", "城关镇"]);
dsy.add("0_16_13", ["卧龙", "宛城", "邓州", "南召县", "城关镇", "方城县", "城关镇", "西峡县", "镇平县", "城关镇", "内乡县", "城关镇", "淅川县", "社旗县", "赊店镇", "唐河县", "新野县", "城关镇", "桐柏县", "城关镇"]);
dsy.add("0_16_14", ["河", "平桥", "息县", "城关镇", "淮滨县", "城关镇", "潢川县", "光山县", "固始县", "城关镇", "商城县", "城关镇", "罗山县", "城关镇", "新县", "新集镇"]);
dsy.add("0_16_15", ["川汇", "项城", "扶沟县", "城关镇", "西华县", "城关镇", "商水县", "城关镇", "太康县", "城关镇", "鹿邑县", "城关镇", "郸城县", "城关镇", "淮阳县", "城关镇", "沈丘县", "槐店镇"]);
dsy.add("0_16_16", ["驿城", "确山县", "盘龙镇", "泌阳县", "泌水镇", "遂平县", "灈阳镇", "西平县", "上蔡县", "蔡都镇", "汝南县", "汝宁镇", "平舆县", "古槐镇", "新蔡县", "古吕镇", "正阳县", "真阳镇"]);
dsy.add("0_16", ["郑州", "开封", "三门峡", "洛阳", "焦作", "新乡", "鹤壁", "安阳", "濮阳", "商丘", "许昌", "漯河", "平顶山", "南阳", "信阳", "周口", "驻马店"]);
dsy.add("0_17_0", ["江岸", "江汉", "硚口", "汉阳", "武昌", "青山", "洪山", "东西湖", "汉南", "蔡甸", "江夏", "黄陂", "新洲"]);
dsy.add("0_17_1", ["张湾", "茅箭", "丹江口", "郧县", "城关镇", "竹山县", "城关镇", "房县", "城关镇", "郧西县", "城关镇", "竹溪县", "城关镇"]);
dsy.add("0_17_2", ["襄城", "樊城", "襄阳", "老河口", "枣阳", "宜城", "南漳县", "城关镇", "谷城县", "城关镇", "保康县", "城关镇"]);
dsy.add("0_17_3", ["东宝", "掇刀", "钟祥", "沙洋县", "沙洋镇", "京山县", "新市镇"]);
dsy.add("0_17_4", ["孝南", "应城", "安陆", "汉川", "孝昌县", "花园镇", "大悟县", "城关镇", "云梦县", "城关镇"]);
dsy.add("0_17_5", ["黄州", "麻城", "武穴", "红安县", "城关镇", "罗田县", "凤山镇", "英山县", "温泉镇", "浠水县", "清泉镇", "蕲春县", "漕河镇", "黄梅县", "黄梅镇", "团风县", "团风镇"]);
dsy.add("0_17_6", ["鄂城", "梁子湖", "华容"]);
dsy.add("0_17_7", ["黄石港", "西塞山", "下陆", "铁山", "大冶", "阳新县", "兴国镇"]);
dsy.add("0_17_8", ["咸安", "赤壁", "嘉鱼县", "鱼岳镇", "通城县", "隽水镇", "崇阳县", "天城镇", "通山县", "通羊镇"]);
dsy.add("0_17_9", ["沙", "荆州", "石首", "洪湖", "松滋", "江陵县", "郝穴镇", "公安县", "斗湖堤镇", "监利县", "容城镇"]);
dsy.add("0_17_10", ["西陵", "伍家岗", "点军", "猇亭", "夷陵", "枝江", "宜都", "当阳", "远安县", "鸣凤镇", "兴山县", "古夫镇", "秭归县", "茅坪镇", "长阳土家族自治县", "龙舟坪镇", "五峰土家族自治县", "五峰镇"]);
dsy.add("0_17_11", ["曾都", "广水"]);
dsy.add("0_17_12", ["仙桃", "天门", "潜江", "神农架林", "松柏镇"]);
dsy.add("0_17_13", ["恩施", "利川", "建始县", "业州镇", "巴东县", "信陵镇", "宣恩县", "珠山镇", "咸丰县", "高乐山镇", "来凤县", "翔凤镇", "鹤峰县", "容美镇"]);
dsy.add("0_17", ["武汉", "十堰", "襄樊", "荆门", "孝感", "黄冈", "鄂州", "黄石", "咸宁", "荆州", "宜昌", "随州", "省直辖县级行政单位", "恩施州"]);
dsy.add("0_18_0", ["长沙", "岳麓", "芙蓉", "天心", "开福", "雨花", "浏阳", "长沙县", "星沙镇", "望城县", "高塘岭镇", "宁乡县", "玉潭镇"]);
dsy.add("0_18_1", ["永定", "武陵源", "慈利县", "零阳镇", "桑植县", "澧源镇"]);
dsy.add("0_18_2", ["武陵", "鼎城", "津市", "安乡县", "城关镇", "汉寿县", "龙阳镇", "澧县", "澧阳镇", "临澧县", "安福镇", "桃源县", "漳江镇", "石门县", "楚江镇"]);
dsy.add("0_18_3", ["赫山", "资阳", "沅江", "南县", "南洲镇", "桃江县", "桃花江镇", "安化县", "东坪镇"]);
dsy.add("0_18_4", ["岳阳楼", "君山", "云溪", "汨罗", "临湘", "岳阳县", "荣家湾镇", "华容县", "城关镇", "湘阴县", "文星镇", "平江县", "汉昌镇"]);
dsy.add("0_18_5", ["天元", "荷塘", "芦淞", "石峰", "醴陵", "株洲县", "渌口镇", "攸县", "城关镇", "茶陵县", "城关镇", "炎陵县", "霞阳镇"]);
dsy.add("0_18_6", ["岳塘", "雨湖", "湘乡", "韶山", "湘潭县", "易俗河镇"]);
dsy.add("0_18_7", ["雁峰", "珠晖", "石鼓", "蒸湘", "南岳", "常宁", "耒阳", "衡阳县", "西渡镇", "衡南县", "云集镇", "衡山县", "开云镇", "衡东县", "城关镇", "祁东县", "洪桥镇"]);
dsy.add("0_18_8", ["北湖", "苏仙", "资兴", "桂阳县", "城关镇", "永兴县", "城关镇", "宜章县", "城关镇", "嘉禾县", "城关镇", "临武县", "城关镇", "汝城县", "城关镇", "桂东县", "城关镇", "安仁县", "城关镇"]);
dsy.add("0_18_9", ["冷水滩", "零陵", "东安县", "白牙市镇", "道县", "道江镇", "宁远县", "舜陵镇", "江永县", "潇浦镇", "蓝山县", "塔峰镇", "新田县", "龙泉镇", "双牌县", "泷泊镇", "祁阳县", "浯溪镇", "江华瑶族自治县", "沱江镇"]);
dsy.add("0_18_10", ["双清", "大祥", "北塔", "武冈", "邵东县", "两市镇", "邵阳县", "塘渡口镇", "新邵县", "酿溪镇", "隆回县", "桃洪镇", "洞口县", "洞口镇", "绥宁县", "长铺镇", "新宁县", "金石镇", "城步苗族自治县", "儒林镇"]);
dsy.add("0_18_11", ["鹤城", "洪江", "沅陵县", "沅陵镇", "辰溪县", "辰阳镇", "溆浦县", "卢峰镇", "中方县", "中方镇", "会同县", "林城镇", "麻阳苗族自治县", "高村镇", "新晃侗族自治县", "新晃镇", "芷江侗族自治县", "芷江镇", "靖州苗族侗族自治县", "渠阳镇", "通道侗族自治县", "双江镇"]);
dsy.add("0_18_12", ["娄星", "冷水江", "涟源", "双峰县", "永丰镇", "新化县", "上梅镇"]);
dsy.add("0_18_13", ["吉首", "泸溪县", "白沙镇", "凤凰县", "沱江镇", "花垣县", "花垣镇", "保靖县", "迁陵镇", "古丈县", "古阳镇", "永顺县", "灵溪镇", "龙山县"]);
dsy.add("0_18", ["长沙", "张家界", "常德", "益阳", "岳阳", "株洲", "湘潭", "衡阳", "郴州", "永州", "邵阳", "怀化", "娄底", "湘西州"]);
dsy.add("0_19_0", ["越秀", "荔湾", "海珠", "天河", "白云", "黄埔", "番禺", "花都", "南沙", "萝岗", "增城", "从化"]);
dsy.add("0_19_1", ["福田", "罗湖", "南山", "宝安", "龙岗", "盐田"]);
dsy.add("0_19_2", ["清城", "英德", "连州", "佛冈县", "石角镇", "阳山县", "阳城镇", "清新县", "太和镇", "连山壮族瑶族自治县", "吉田镇", "连南瑶族自治县", "三江镇"]);
dsy.add("0_19_3", ["浈江", "武江", "曲江", "乐昌", "南雄", "始兴县", "太平镇", "仁化县", "仁化镇", "翁源县", "龙仙镇", "新丰县", "乳源瑶族自治县", "乳城镇"]);
dsy.add("0_19_4", ["源城", "紫金县", "紫城镇", "龙川县", "老隆镇", "连平县", "元善镇", "和平县", "阳明镇", "东源县", "仙塘镇"]);
dsy.add("0_19_5", ["梅江", "兴宁", "梅县", "程江镇", "大埔县", "湖寮镇", "丰顺县", "汤坑镇", "五华县", "水寨镇", "平远县", "大柘镇", "蕉岭县", "蕉城镇"]);
dsy.add("0_19_6", ["湘桥", "潮安县", "庵埠镇", "饶平县", "黄冈镇"]);
dsy.add("0_19_7", ["金平", "濠江", "龙湖", "潮阳", "潮南", "澄海", "南澳县", "后宅镇"]);
dsy.add("0_19_8", ["榕城", "普宁", "揭东县", "曲溪镇", "揭西县", "河婆镇", "惠来县", "惠城镇"]);
dsy.add("0_19_9", ["城", "陆丰", "海丰县", "海城镇", "陆河县", "河田镇"]);
dsy.add("0_19_10", ["惠城", "惠阳", "博罗县", "罗阳镇", "惠东县", "龙门县"]);
dsy.add("0_19_12", ["香洲", "斗门", "金湾"]);
dsy.add("0_19_14", ["江海", "蓬江", "新会", "恩平", "台山", "开平", "鹤山"]);
dsy.add("0_19_15", ["禅城", "南海", "顺德", "三水", "高明"]);
dsy.add("0_19_16", ["端州", "鼎湖", "高要", "四会", "广宁县", "南街镇", "怀集县", "怀城镇", "封开县", "江口镇", "德庆县"]);
dsy.add("0_19_17", ["云城", "罗定", "云安县", "六都镇", "新兴县", "新城镇", "郁南县", "都城镇"]);
dsy.add("0_19_18", ["江城", "阳春", "阳西县", "织镇", "阳东县", "东城镇"]);
dsy.add("0_19_19", ["茂南", "茂港", "化州", "信宜", "高州", "电白县", "水东镇"]);
dsy.add("0_19_20", ["赤坎", "霞山", "坡头", "麻章", "吴川", "廉江", "雷州", "遂溪县", "遂城镇", "徐闻县", "撤销广州市东山", "芳村", "设立广州市南沙", "萝岗"]);
dsy.add("0_19", ["广州", "深圳", "清远", "韶关", "河源", "梅州", "潮州", "汕头", "揭阳", "汕尾", "惠州", "东莞", "珠海", "中山", "江门", "佛山", "肇庆", "云浮", "阳江", "茂名", "湛江"]);
dsy.add("0_20_0", ["青秀", "兴宁", "江南", "西乡塘", "良庆", "邕宁", "武鸣县", "横县", "宾阳县", "上林县", "隆安县", "马山县"]);
dsy.add("0_20_1", ["象山", "叠彩", "秀峰", "七星", "雁山", "阳朔县", "阳朔镇", "临桂县", "临桂镇", "灵川县", "灵川镇", "全州县", "全州镇", "兴安县", "兴安镇", "永福县", "永福镇", "灌阳县", "灌阳镇", "资源县", "资源镇", "平乐县", "平乐镇", "荔浦县", "荔城镇", "龙胜各族自治县", "龙胜镇", "恭城瑶族自治县", "恭城镇"]);
dsy.add("0_20_2", ["城中", "鱼峰", "柳南", "柳北", "柳江县", "拉堡镇", "柳城县", "大埔镇", "鹿寨县", "鹿寨镇", "融安县", "长安镇", "三江侗族自治县", "古宜镇", "融水苗族自治县", "融水镇"]);
dsy.add("0_20_3", ["万秀", "蝶山", "长洲", "岑溪", "苍梧县", "龙圩镇", "藤县", "藤州镇", "蒙山县", "蒙山镇"]);
dsy.add("0_20_4", ["港北", "港南", "覃塘", "桂平", "平南县", "平南镇"]);
dsy.add("0_20_5", ["玉州", "北流", "兴业县", "石南镇", "容县", "容州镇", "陆川县", "陆城镇", "博白县", "博白镇"]);
dsy.add("0_20_6", ["钦南", "钦北", "灵山县", "灵城镇", "浦北县", "小江镇"]);
dsy.add("0_20_7", ["海城", "银海", "铁山港", "合浦县", "廉州镇"]);
dsy.add("0_20_8", ["港口", "防城", "东兴", "上思县", "思阳镇"]);
dsy.add("0_20_9", ["江州", "凭祥", "扶绥县", "新宁镇", "大新县", "桃城镇", "天等县", "天等镇", "宁明县", "城中镇", "龙州县", "龙州镇"]);
dsy.add("0_20_10", ["右江", "田阳县", "田州镇", "田东县", "平马镇", "平果县", "马头镇", "德保县", "城关镇", "靖西县", "新靖镇", "那坡县", "城厢镇", "凌云县", "泗城镇", "乐业县", "同乐镇", "西林县", "八达镇", "田林县", "乐里镇", "隆林各族自治县", "新州镇"]);
dsy.add("0_20_11", ["金城江", "宜州", "南丹县", "城关镇", "天峨县", "六排镇", "凤山县", "凤城镇", "东兰县", "东兰镇", "巴马瑶族自治县", "巴马镇", "都安瑶族自治县", "安阳镇", "大化瑶族自治县", "大化镇", "罗城仫佬族自治县", "东门镇", "环江毛南族自治县", "思恩镇"]);
dsy.add("0_20_12", ["兴宾", "合山", "象州县", "象州镇", "武宣县", "武宣镇", "忻城县", "城关镇", "金秀瑶族自治县", "金秀镇"]);
dsy.add("0_20_13", ["八步", "昭平县", "昭平镇", "钟山县", "钟山镇", "富川瑶族自治县", "富阳镇"]);
dsy.add("0_20", ["南宁", "桂林", "柳州", "梧州", "贵港", "玉林", "钦州", "北海", "防城港", "崇左", "百色", "河池", "来宾", "贺州"]);
dsy.add("0_21_0", ["龙华", "秀英", "琼山", "美兰"]);
dsy.add("0_21_2", ["文昌", "琼海", "万宁", "五指山", "东方", "儋州", "临高县", "临城镇", "澄迈县", "金江镇", "定安县", "定城镇", "屯昌县", "屯城镇", "昌江黎族自治县", "石碌镇", "白沙黎族自治县", "牙叉镇", "琼中黎族苗族自治县", "营根镇", "陵水黎族自治县", "椰林镇", "保亭黎族苗族自治县", "保城镇", "乐东黎族自治县", "抱由镇"]);
dsy.add("0_21", ["海口", "三亚", "省直辖行政单位"]);
dsy.add("0_22_0", ["青羊", "锦江", "金牛", "武侯", "成华", "龙泉驿", "青白江", "新都", "温江", "都江堰", "彭州", "邛崃", "崇州", "金堂县", "赵镇", "双流县", "郫县", "郫筒镇", "大邑县", "晋原镇", "蒲江县", "鹤山镇", "新津县", "五津镇"]);
dsy.add("0_22_1", ["市中", "元坝", "朝天", "旺苍县", "东河镇", "青川县", "乔庄镇", "剑阁县", "下寺镇", "苍溪县", "陵江镇"]);
dsy.add("0_22_2", ["涪城", "游仙", "江油", "三台县", "潼川镇", "盐亭县", "云溪镇", "安县", "花荄镇", "梓潼县", "文昌镇", "北川羌族自治县", "曲山镇", "平武县", "龙安镇"]);
dsy.add("0_22_3", ["旌阳", "什邡", "广汉", "绵竹", "罗江县", "罗江镇", "中江县", "凯江镇"]);
dsy.add("0_22_4", ["顺庆", "高坪", "嘉陵", "阆中", "南部县", "南隆镇", "营山县", "朗池镇", "蓬安县", "周口镇", "仪陇县", "新政镇", "西充县", "晋城镇"]);
dsy.add("0_22_5", ["广安", "华蓥", "岳池县", "九龙镇", "武胜县", "沿口镇", "邻水县", "鼎屏镇"]);
dsy.add("0_22_6", ["船山", "安居", "蓬溪县", "赤城镇", "射洪县", "太和镇", "大英县", "蓬莱镇"]);
dsy.add("0_22_7", ["市中", "东兴", "威远县", "严陵镇", "资中县", "重龙镇", "隆昌县", "金鹅镇"]);
dsy.add("0_22_8", ["市中", "沙湾", "五通桥", "金口河", "峨眉山", "犍为县", "玉津镇", "井研县", "研城镇", "夹江县", "漹城镇", "沐川县", "沐溪镇", "峨边彝族自治县", "沙坪镇", "马边彝族自治县", "民建镇"]);
dsy.add("0_22_9", ["自流井", "大安", "贡井", "沿滩", "荣县", "旭阳镇", "富顺县", "富世镇"]);
dsy.add("0_22_10", ["江阳", "纳溪", "龙马潭", "泸县", "福集镇", "合江县", "合江镇", "叙永县", "叙永镇", "古蔺县", "古蔺镇"]);
dsy.add("0_22_11", ["翠屏", "宜宾县", "柏溪镇", "南溪县", "南溪镇", "江安县", "江安镇", "长宁县", "长宁镇", "高县", "庆符镇", "筠连县", "筠连镇", "珙县", "巡场镇", "兴文县", "中城镇", "屏山县", "屏山镇"]);
dsy.add("0_22_12", ["东", "西", "仁和", "米易县", "攀莲镇", "盐边县", "桐子林镇"]);
dsy.add("0_22_13", ["巴州", "通江县", "诺江镇", "南江县", "南江镇", "平昌县", "江口镇"]);
dsy.add("0_22_14", ["通川", "万源", "达县", "南外镇", "宣汉县", "东乡镇", "开江县", "新宁镇", "大竹县", "竹阳镇", "渠县", "渠江镇"]);
dsy.add("0_22_15", ["雁江", "简阳", "乐至县", "天池镇", "安岳县", "岳阳镇"]);
dsy.add("0_22_16", ["东坡", "仁寿县", "文林镇", "彭山县", "凤鸣镇", "洪雅县", "洪川镇", "丹棱县", "丹棱镇", "青神县", "城厢镇"]);
dsy.add("0_22_17", ["雨城", "名山县", "蒙阳镇", "荥经县", "严道镇", "汉源县", "富林镇", "石棉县", "新棉镇", "天全县", "城厢镇", "芦山县", "芦阳镇", "宝兴县", "穆坪镇"]);
dsy.add("0_22_18", ["马尔康县", "马尔康镇", "汶川县", "威州镇", "理县", "杂谷脑镇", "茂县", "凤仪镇", "松潘县", "进安镇", "九寨沟县", "永乐镇", "金川县", "金川镇", "小金县", "美兴镇", "黑水县", "芦花镇", "壤塘县", "壤柯镇", "阿坝县", "阿坝镇", "若尔盖县", "达扎寺镇", "红原县", "邛溪镇"]);
dsy.add("0_22_19", ["康定县", "炉城镇", "泸定县", "泸桥镇", "丹巴县", "章谷镇", "九龙县", "呷尔镇", "雅江县", "河口镇", "道孚县", "鲜水镇", "炉霍县", "新都镇", "甘孜县", "甘孜镇", "新龙县", "茹龙镇", "德格县", "更庆镇", "白玉县", "建设镇", "石渠县", "尼呷镇", "色达县", "色柯镇", "理塘县", "高城镇", "巴塘县", "夏邛镇", "乡城县", "桑披镇", "稻城县", "金珠镇", "得荣县", "松麦镇"]);
dsy.add("0_22_20", ["西昌", "盐源县", "盐井镇", "德昌县", "德州镇", "会理县", "城关镇", "会东县", "会东镇", "宁南县", "披砂镇", "普格县", "普基镇", "布拖县", "特木里镇", "金阳县", "天地坝镇", "昭觉县", "新城镇", "喜德县", "光明镇", "冕宁县", "城厢镇", "越西县", "越城镇", "甘洛县", "新市坝镇", "美姑县", "巴普镇", "雷波县", "锦城镇", "木里藏族自治县", "乔瓦镇"]);
dsy.add("0_22", ["成都", "广元", "绵阳", "德阳", "南充", "广安", "遂宁", "内江", "乐山", "自贡", "泸州", "宜宾", "攀枝花", "巴中", "达州", "资阳", "眉山", "雅安", "阿坝州", "甘孜州", "凉山州"]);
dsy.add("0_23_0", ["乌当", "南明", "云岩", "花溪", "白云", "小河", "清镇", "开阳县", "城关镇", "修文县", "龙场镇", "息烽县", "永靖镇"]);
dsy.add("0_23_1", ["钟山", "盘县", "红果镇", "六枝特", "平寨镇", "水城县"]);
dsy.add("0_23_2", ["红花岗", "汇川", "赤水", "仁怀", "遵义县", "南白镇", "桐梓县", "娄山关镇", "绥阳县", "洋川镇", "正安县", "凤仪镇", "凤冈县", "龙泉镇", "湄潭县", "湄江镇", "余庆县", "白泥镇", "习水县", "东皇镇", "道真仡佬族苗族自治县", "玉溪镇", "务川仡佬族苗族自治县", "都濡镇"]);
dsy.add("0_23_3", ["西秀", "平坝县", "城关镇", "普定县", "城关镇", "关岭布依族苗族自治县", "关索镇", "镇宁布依族苗族自治县", "城关镇", "紫云苗族布依族自治县", "松山镇"]);
dsy.add("0_23_4", ["毕节", "大方县", "大方镇", "黔西县", "城关镇", "金沙县", "城关镇", "织金县", "城关镇", "纳雍县", "雍熙镇", "赫章县", "城关镇", "威宁彝族回族苗族自治县", "草海镇"]);
dsy.add("0_23_5", ["铜仁", "江口县", "双江镇", "石阡县", "汤山镇", "思南县", "思唐镇", "德江县", "青龙镇", "玉屏侗族自治县", "平溪镇", "印江土家族苗族自治县", "峨岭镇", "沿河土家族自治县", "和平镇", "松桃苗族自治县", "蓼皋镇", "万山特", "万山镇"]);
dsy.add("0_23_6", ["凯里", "黄平县", "新州镇", "施秉县", "城关镇", "三穗县", "八弓镇", "镇远县", "阳镇", "岑巩县", "思旸镇", "天柱县", "凤城镇", "锦屏县", "三江镇", "剑河县", "革东镇", "台江县", "台拱镇", "黎平县", "德凤镇", "榕江县", "古州镇", "从江县", "丙妹镇", "雷山县", "丹江镇", "麻江县", "杏山镇", "丹寨县", "龙泉镇"]);
dsy.add("0_23_7", ["都匀", "福泉", "荔波县", "玉屏镇", "贵定县", "城关镇", "瓮安县", "雍阳镇", "独山县", "城关镇", "平塘县", "平湖镇", "罗甸县", "龙坪镇", "长顺县", "长寨镇", "龙里县", "龙山镇", "惠水县", "和平镇", "三都水族自治县", "三合镇"]);
dsy.add("0_23_8", ["兴义", "兴仁县", "城关镇", "普安县", "盘水镇", "晴隆县", "莲城镇", "贞丰县", "珉谷镇", "望谟县", "复兴镇", "册亨县", "者楼镇", "安龙县", "新安镇", "剑河县人民政府驻地由柳川镇迁至革东镇"]);
dsy.add("0_23", ["贵阳", "六盘水", "遵义", "安顺", "毕节地", "铜仁地", "黔东南州", "黔南州", "黔西南州"]);
dsy.add("0_24_0", ["盘龙", "五华", "官渡", "西山", "东川", "安宁", "呈贡县", "龙城镇", "晋宁县", "昆阳镇", "富民县", "永定镇", "宜良县", "匡远镇", "嵩明县", "嵩阳镇", "石林彝族自治县", "鹿阜镇", "禄劝彝族苗族自治县", "屏山镇", "寻甸回族彝族自治县", "仁德镇"]);
dsy.add("0_24_1", ["麒麟", "宣威", "马龙县", "通泉镇", "沾益县", "西平镇", "富源县", "中安镇", "罗平县", "罗雄镇", "师宗县", "丹凤镇", "陆良县", "中枢镇", "会泽县", "金钟镇"]);
dsy.add("0_24_2", ["红塔", "江川县", "大街镇", "澄江县", "凤麓镇", "通海县", "秀山镇", "华宁县", "宁州镇", "易门县", "龙泉镇", "峨山彝族自治县", "双江镇", "新平彝族傣族自治县", "桂山镇", "元江哈尼族彝族傣族自治县", "澧江镇"]);
dsy.add("0_24_3", ["隆阳", "施甸县", "甸阳镇", "腾冲县", "腾越镇", "龙陵县", "龙山镇", "昌宁县", "田园镇"]);
dsy.add("0_24_4", ["昭阳", "鲁甸县", "文屏镇", "巧家县", "新华镇", "盐津县", "盐井镇", "大关县", "翠华镇", "永善县", "溪落渡镇", "绥江县", "中城镇", "镇雄县", "乌峰镇", "彝良县", "角奎镇", "威信县", "扎西镇", "水富县", "向家坝镇"]);
dsy.add("0_24_5", ["古城", "永胜县", "永北镇", "华坪县", "中心镇", "玉龙纳西族自治县", "黄山镇", "宁蒗彝族自治县", "大兴镇"]);
dsy.add("0_24_6", ["翠云", "普洱哈尼族彝族自治县", "宁洱镇", "墨江哈尼族自治县", "联珠镇", "景东彝族自治县", "锦屏镇", "景谷傣族彝族自治县", "威远镇", "镇沅彝族哈尼族拉祜族自治县", "恩乐镇", "江城哈尼族彝族自治县", "勐烈镇", "孟连傣族拉祜族佤族自治县", "娜允镇", "澜沧拉祜族自治县", "勐朗镇", "西盟佤族自治县", "勐梭镇"]);
dsy.add("0_24_7", ["临翔", "凤庆县", "凤山镇", "云县", "爱华镇", "永德县", "德党镇", "镇康县", "南伞镇", "双江拉祜族佤族布朗族傣族自治县", "勐勐镇", "耿马傣族佤族自治县", "耿马镇", "沧源佤族自治县", "勐董镇"]);
dsy.add("0_24_8", ["潞西", "瑞丽", "梁河县", "遮岛镇", "盈江县", "平原镇", "陇川县", "章凤镇"]);
dsy.add("0_24_9", ["泸水县六库镇", "泸水县", "六库镇", "福贡县", "上帕镇", "贡山独龙族怒族自治县", "茨开镇", "兰坪白族普米族自治县", "金顶镇"]);
dsy.add("0_24_10", ["香格里拉县", "建塘镇", "德钦县", "升平镇", "维西傈僳族自治县", "保和镇"]);
dsy.add("0_24_11", ["大理", "祥云县", "祥城镇", "宾川县", "金牛镇", "弥渡县", "弥城镇", "永平县", "博南镇", "云龙县", "诺邓镇", "洱源县", "茈碧湖镇", "剑川县", "金华镇", "鹤庆县", "云鹤镇", "漾濞彝族自治县", "苍山西镇", "南涧彝族自治县", "南涧镇", "巍山彝族回族自治县", "南诏镇"]);
dsy.add("0_24_12", ["楚雄", "双柏县", "妥甸镇", "牟定县", "共和镇", "南华县", "龙川镇", "姚安县", "栋川镇", "大姚县", "金碧镇", "永仁县", "永定镇", "元谋县", "元马镇", "武定县", "狮山镇", "禄丰县", "金山镇"]);
dsy.add("0_24_13", ["蒙自县", "文澜镇", "个旧", "开远", "绿春县", "大兴镇", "建水县", "临安镇", "石屏县", "异龙镇", "弥勒县", "弥阳镇", "泸西县", "中枢镇", "元阳县", "南沙镇", "红河县", "迤萨镇", "金平苗族瑶族傣族自治县", "金河镇", "河口瑶族自治县", "河口镇", "屏边苗族自治县", "玉屏镇"]);
dsy.add("0_24_14", ["文山县", "开化镇", "砚山县", "江那镇", "西畴县", "西洒镇", "麻栗坡县", "麻栗镇", "马关县", "马白镇", "丘北县", "锦屏镇", "广南县", "莲城镇", "富宁县", "新华镇"]);
dsy.add("0_24_15", ["景洪", "勐海县", "勐海镇", "勐腊县", "勐腊镇"]);
dsy.add("0_24", ["昆明", "曲靖", "玉溪", "保山", "昭通", "丽江", "思茅", "临沧", "德宏", "怒江", "迪庆", "大理", "楚雄", "红河", "文山", "西双版纳"]);
dsy.add("0_25_0", ["城关", "林周县", "甘丹曲果镇", "当雄县", "当曲卡镇", "尼木县", "塔荣镇", "曲水县", "曲水镇", "堆龙德庆县", "东嘎镇", "达孜县", "德庆镇", "墨竹工卡县", "工卡镇"]);
dsy.add("0_25_1", ["那曲县", "那曲镇", "嘉黎县", "阿扎镇", "比如县", "比如镇", "聂荣县", "聂荣镇", "安多县", "帕那镇", "申扎县", "申扎镇", "索县", "亚拉镇", "班戈县", "普保镇", "巴青县", "拉西镇", "尼玛县", "尼玛镇"]);
dsy.add("0_25_2", ["昌都县", "城关镇", "江达县", "江达镇", "贡觉县", "莫洛镇", "类乌齐县", "桑多镇", "丁青县", "丁青镇", "察雅县", "烟多镇", "八宿县", "白玛镇", "左贡县", "旺达镇", "芒康县", "嘎托镇", "洛隆县", "孜托镇", "边坝县", "草卡镇"]);
dsy.add("0_25_3", ["林芝县", "八一镇", "工布江达县", "工布江达镇", "米林县", "米林镇", "墨脱县", "墨脱镇", "波密县", "扎木镇", "察隅县", "竹瓦根镇", "朗县", "朗镇"]);
dsy.add("0_25_4", ["乃东县", "泽当镇", "扎囊县", "扎塘镇", "贡嘎县", "吉雄镇", "桑日县", "桑日镇", "琼结县", "琼结镇", "曲松县", "曲松镇", "措美县", "措美镇", "洛扎县", "洛扎镇", "加查县", "安绕镇", "隆子县", "隆子镇", "错那县", "错那镇", "浪卡子县", "浪卡子镇"]);
dsy.add("0_25_5", ["日喀则", "南木林县", "南木林镇", "江孜县", "江孜镇", "定日县", "协格尔镇", "萨迦县", "萨迦镇", "拉孜县", "曲下镇", "昂仁县", "卡嘎镇", "谢通门县", "卡嘎镇", "白朗县", "洛江镇", "仁布县", "德吉林镇", "康马县", "康马镇", "定结县", "江嘎镇", "仲巴县", "拉让乡", "亚东县", "下司马镇", "吉隆县", "宗嘎镇", "聂拉木县", "聂拉木镇", "萨嘎县", "加加镇", "岗巴县", "岗巴镇"]);
dsy.add("0_25_6", ["噶尔县", "狮泉河镇", "普兰县", "普兰镇", "札达县", "托林镇", "日土县", "日土镇", "革吉县", "革吉镇", "改则县", "改则镇", "措勤县", "措勤镇", "林芝县人民政府驻地由林芝镇迁至八一镇"]);
dsy.add("0_25", ["拉萨", "那曲地", "昌都地", "林芝地", "山南地", "日喀则地", "阿里地"]);
dsy.add("0_26_0", ["莲湖", "新城", "碑林", "灞桥", "未央", "雁塔", "阎良", "临潼", "长安", "蓝田县", "蓝关镇", "周至县", "二曲镇", "户县", "甘亭镇", "高陵县", "鹿苑镇"]);
dsy.add("0_26_1", ["宝塔", "延长县", "七里村镇", "延川县", "延川镇", "子长县", "瓦窑堡镇", "安塞县", "真武洞镇", "志丹县", "保安镇", "吴起县", "吴旗镇", "甘泉县", "城关镇", "富县", "富城镇", "洛川县", "凤栖镇", "宜川县", "丹州镇", "黄龙县", "石堡镇", "黄陵县", "桥山镇"]);
dsy.add("0_26_2", ["耀州", "王益", "印台", "宜君县", "城关镇"]);
dsy.add("0_26_3", ["临渭", "华阴", "韩城", "华县", "华州镇", "潼关县", "城关镇", "大荔县", "城关镇", "蒲城县", "城关镇", "澄城县", "城关镇", "白水县", "城关镇", "合阳县", "城关镇", "富平县", "窦村镇"]);
dsy.add("0_26_4", ["秦都", "杨陵", "渭城", "兴平", "三原县", "城关镇", "泾阳县", "泾干镇", "乾县", "城关镇", "礼泉县", "城关镇", "永寿县", "监军镇", "彬县", "城关镇", "长武县", "昭仁镇", "旬邑县", "城关镇", "淳化县", "城关镇", "武功县", "普集镇"]);
dsy.add("0_26_5", ["渭滨", "金台", "陈仓", "凤翔县", "城关镇", "岐山县", "凤鸣镇", "扶风县", "城关镇", "眉县", "首善镇", "陇县", "城关镇", "千阳县", "城关镇", "麟游县", "九成宫镇", "凤县", "双石铺镇", "太白县", "嘴头镇"]);
dsy.add("0_26_6", ["汉台", "南郑县", "城关镇", "城固县", "博望镇", "洋县", "洋州镇", "西乡县", "城关镇", "勉县", "勉阳镇", "宁强县", "汉源镇", "略阳县", "城关镇", "镇巴县", "泾洋镇", "留坝县", "城关镇", "佛坪县", "袁家庄镇"]);
dsy.add("0_26_7", ["榆阳", "神木县", "神木镇", "府谷县", "府谷镇", "横山县", "横山镇", "靖边县", "张家畔镇", "定边县", "定边镇", "绥德县", "名州镇", "米脂县", "银州镇", "佳县", "佳芦镇", "吴堡县", "宋家川镇", "清涧县", "宽洲镇", "子洲县", "双湖峪镇"]);
dsy.add("0_26_8", ["汉滨", "汉阴县", "城关镇", "石泉县", "城关镇", "宁陕县", "城关镇", "紫阳县", "城关镇", "岚皋县", "城关镇", "平利县", "城关镇", "镇坪县", "城关镇", "旬阳县", "城关镇", "白河县", "城关镇"]);
dsy.add("0_26_9", ["商州", "洛南县", "城关镇", "丹凤县", "龙驹寨镇", "商南县", "城关镇", "山阳县", "城关镇", "镇安县", "永乐镇", "柞水县", "乾佑镇"]);
dsy.add("0_26", ["西安", "延安", "铜川", "渭南", "咸阳", "宝鸡", "汉中", "榆林", "安康", "商洛"]);
dsy.add("0_27_0", ["城关", "七里河", "西固", "安宁", "红古", "永登县", "城关镇", "皋兰县", "石洞镇", "榆中县", "城关镇"]);
dsy.add("0_27_1", ["金昌", "金川", "永昌县", "城关镇"]);
dsy.add("0_27_2", ["白银", "平川", "靖远县", "乌兰镇", "会宁县", "会师镇", "景泰县", "一条山镇"]);
dsy.add("0_27_3", ["秦州", "麦积", "清水县", "永清镇", "秦安县", "兴国镇", "甘谷县", "大像山镇", "武山县", "城关镇", "张家川回族自治县", "张家川镇"]);
dsy.add("0_27_4", ["凉州", "民勤县", "城关镇", "古浪县", "古浪镇", "天祝藏族自治县", "华藏寺镇"]);
dsy.add("0_27_5", ["肃州", "玉门", "敦煌", "金塔县", "金塔镇", "安西县", "渊泉镇", "肃北蒙古族自治县", "党城湾镇", "阿克塞哈萨克族自治县", "红柳湾镇"]);
dsy.add("0_27_6", ["甘州", "民乐县", "洪水镇", "临泽县", "沙河镇", "高台县", "城关镇", "山丹县", "清泉镇", "肃南裕固族自治县", "红湾寺镇"]);
dsy.add("0_27_7", ["西峰", "庆城县", "庆城镇", "环县", "环城镇", "华池县", "柔远镇", "合水县", "西华池镇", "正宁县", "山河镇", "宁县", "新宁镇", "镇原县", "城关镇"]);
dsy.add("0_27_8", ["崆峒", "泾川县", "城关镇", "灵台县", "中台镇", "崇信县", "锦屏镇", "华亭县", "东华镇", "庄浪县", "水洛镇", "静宁县", "城关镇"]);
dsy.add("0_27_9", ["安定", "通渭县", "平襄镇", "临洮县", "洮阳镇", "漳县", "武阳镇", "岷县", "岷阳镇", "渭源县", "清源镇", "陇西县", "巩昌镇"]);
dsy.add("0_27_10", ["武都", "成县", "城关镇", "宕昌县", "城关镇", "康县", "文县", "城关镇", "西和县", "汉源镇", "礼县", "城关镇", "两当县", "城关镇", "徽县", "城关镇"]);
dsy.add("0_27_11", ["临夏", "临夏县", "韩集镇", "康乐县", "附城镇", "永靖县", "刘家峡镇", "广河县", "城关镇", "和政县", "城关镇", "东乡族自治县", "锁南坝镇", "积石山保安族东乡族撒拉族自治县", "吹麻滩镇"]);
dsy.add("0_27_12", ["合作", "临潭县", "城关镇", "卓尼县", "柳林镇", "舟曲县", "城关镇", "迭部县", "电尕镇", "玛曲县", "尼玛镇", "碌曲县", "玛艾镇", "夏河县", "拉卜楞镇"]);
dsy.add("0_27", ["兰州", "嘉峪关", "白银", "天水", "武威", "酒泉", "张掖", "庆阳", "平凉", "定西", "陇南", "临夏州", "甘南州"]);
dsy.add("0_28_0", ["城中", "城东", "城西", "城北", "大通回族土族自治县", "桥头镇", "湟源县", "城关镇", "湟中县", "鲁沙尔镇"]);
dsy.add("0_28_1", ["平安县", "平安镇", "乐都县", "碾伯镇", "民和回族土族自治县", "川口镇", "互助土族自治县", "威远镇", "化隆回族自治县", "巴燕镇", "循化撒拉族自治县", "积石镇"]);
dsy.add("0_28_2", ["海晏县", "三角城镇", "祁连县", "八宝镇", "刚察县", "沙柳河镇", "门源回族自治县", "浩门镇"]);
dsy.add("0_28_3", ["共和县", "恰卜恰镇", "同德县", "尕巴松多镇", "贵德县", "河阴镇", "兴海县", "子科滩镇", "贵南县", "茫曲镇"]);
dsy.add("0_28_4", ["同仁县", "隆务镇", "尖扎县", "马克唐镇", "泽库县", "泽曲镇", "河南蒙古族自治县", "优干宁镇"]);
dsy.add("0_28_5", ["玛沁县", "大武镇", "班玛县", "赛来塘镇", "甘德县", "柯曲镇", "达日县", "吉迈镇", "久治县", "智青松多镇", "玛多县", "黄河乡"]);
dsy.add("0_28_6", ["玉树县", "结古镇", "杂多县", "萨呼腾镇", "称多县", "称文镇", "治多县", "加吉博洛镇", "囊谦县", "香达镇", "曲麻莱县", "约改镇"]);
dsy.add("0_28_7", ["德令哈", "格尔木", "乌兰县", "希里沟镇", "都兰县", "察汗乌苏镇", "天峻县", "新源镇"]);
dsy.add("0_28", ["西宁", "海东地", "海北州", "海南州", "黄南州", "果洛州", "玉树州", "海西州"]);
dsy.add("0_29_0", ["兴庆", "金凤", "西夏", "灵武", "永宁县", "杨和镇", "贺兰县", "习岗镇"]);
dsy.add("0_29_1", ["大武口", "惠农", "平罗县", "城关镇"]);
dsy.add("0_29_2", ["利通", "青铜峡", "盐池县", "花马池镇", "同心县", "豫海镇"]);
dsy.add("0_29_3", ["原州", "西吉县", "吉强镇", "隆德县", "城关镇", "泾源县", "香水镇", "彭阳县", "白阳镇"]);
dsy.add("0_29_4", ["沙坡头", "中宁县", "海原县"]);
dsy.add("0_29", ["银川", "石嘴山", "吴忠", "固原", "中卫"]);
dsy.add("0_30_0", ["天山", "沙依巴克", "新", "水磨沟", "头屯河", "达坂城", "东山", "乌鲁木齐县", "乌鲁木齐市水磨沟"]);
dsy.add("0_30_1", ["克拉玛依", "独山子", "白碱滩", "乌尔禾"]);
dsy.add("0_30_2", ["石河子", "阿拉尔", "图木舒克", "五家渠"]);
dsy.add("0_30_3", ["喀什", "疏附县", "托克扎克镇", "疏勒县", "疏勒镇", "英吉沙县", "英吉沙镇", "泽普县", "泽普镇", "莎车县", "莎车镇", "叶城县", "喀格勒克镇", "麦盖提县", "麦盖提镇", "岳普湖县", "岳普湖镇", "伽师县", "巴仁镇", "巴楚县", "巴楚镇", "塔什库尔干塔吉克自治县", "塔什库尔干镇"]);
dsy.add("0_30_4", ["阿克苏", "温宿县", "温宿镇", "库车县", "库车镇", "沙雅县", "沙雅镇", "新和县", "新和镇", "拜城县", "拜城镇", "乌什县", "乌什镇", "阿瓦提县", "阿瓦提镇", "柯坪县", "柯坪镇"]);
dsy.add("0_30_5", ["和田", "和田县", "墨玉县", "喀拉喀什镇", "皮山县", "固玛镇", "洛浦县", "洛浦镇", "策勒县", "策勒镇", "于田县", "木尕拉镇", "民丰县", "尼雅镇"]);
dsy.add("0_30_6", ["吐鲁番", "鄯善县", "鄯善镇", "托克逊县", "托克逊镇"]);
dsy.add("0_30_7", ["哈密", "伊吾县", "伊吾镇", "巴里坤哈萨克自治县", "巴里坤镇"]);
dsy.add("0_30_8", ["阿图什", "阿克陶县", "阿克陶镇", "阿合奇县", "阿合奇镇", "乌恰县", "乌恰镇"]);
dsy.add("0_30_9", ["博乐", "精河县", "精河镇", "温泉县", "博格达尔镇"]);
dsy.add("0_30_10", ["昌吉", "阜康", "米泉", "呼图壁县", "呼图壁镇", "玛纳斯县", "玛纳斯镇", "奇台县", "奇台镇", "吉木萨尔县", "吉木萨尔镇", "木垒哈萨克自治县", "木垒镇"]);
dsy.add("0_30_11", ["库尔勒", "轮台县", "轮台镇", "尉犁县", "尉犁镇", "若羌县", "若羌镇", "且末县", "且末镇", "和静县", "和静镇", "和硕县", "特吾里克镇", "博湖县", "博湖镇", "焉耆回族自治县", "焉耆镇"]);
dsy.add("0_30_12", ["伊宁", "奎屯", "伊宁县", "吉里于孜镇", "霍城县", "水定镇", "巩留县", "巩留镇", "新源县", "新源镇", "昭苏县", "昭苏镇", "特克斯县", "特克斯镇", "尼勒克县", "尼勒克镇", "察布查尔锡伯自治县", "察布查尔镇"]);
dsy.add("0_30_13", ["塔城", "乌苏", "额敏县", "额敏镇", "沙湾县", "三道河子镇", "托里县", "托里镇", "裕民县", "哈拉布拉镇", "和布克赛尔蒙古自治县", "和布克赛尔镇"]);
dsy.add("0_30_14", ["阿勒泰", "布尔津县", "布尔津镇", "富蕴县", "库额尔齐斯镇", "福海县", "哈巴河县", "青河县", "吉木乃县"]);
dsy.add("0_30", ["乌鲁木齐", "克拉玛依", "自治区直辖县级行政单位", "喀什地", "阿克苏地", "和田地", "吐鲁番地", "哈密地", "克孜勒苏柯州", "博尔塔拉州", "昌吉州", "巴音郭楞州", "伊犁州", "塔城地", "阿勒泰地"]);
dsy.add("0_31_0", ["中西", "东", "九龙城", "观塘", "南", "深水埗", "湾仔", "黄大仙", "油尖旺", "离岛", "葵青", "北", "西贡", "沙田", "屯门", "大埔", "荃湾", "元朗"]);
dsy.add("0_31", ["香港"]);
dsy.add("0_32_0", ["澳门"]);
dsy.add("0_32", ["澳门"]);
dsy.add("0_33_0", [" "]);
dsy.add("0_33", ["台北", "高雄", "台中", "花莲", "基隆", "嘉义", "金门", "连江", "苗栗", "南投", "澎湖", "屏东", "台东", "台南", "桃园", "新竹", "宜兰", "云林", "彰化"]);
dsy.add("0", ["北京", "天津", "上海", "重庆", "河北", "山西", "内蒙古", "辽宁", "吉林", "黑龙江", "江苏", "浙江", "安徽", "福建", "江西", "山东", "河南", "湖北", "湖南", "广东", "广西", "海南", "四川", "贵州", "云南", "西藏", "陕西", "甘肃", "青海", "宁夏", "新疆", "香港", "澳门", "台湾"]);

var sprovcityid = ["hometownprov", "hometowncity"];

var sprovcityid1 = ["province", "city"];

var opt0 = ["省份", "地级", "市、县级市、县"];

function setup() {
    for (i = 0; i < sprovcityid.length - 1; i++) {
        document.getElementById(sprovcityid[i]).onchange = new Function("change(" + (i + 1) + ");");
    }
    change(0);
}

function setup1() {
    for (i = 0; i < sprovcityid1.length - 1; i++) {
        document.getElementById(sprovcityid1[i]).onchange = new Function("change1(" + (i + 1) + ");");
    }
    change1(0);
}
