/*
 * name: page.detail.online_service.js
 * author: leoqqlv
 * usage:
**/
define("page.detail.online_service.15", function(require, exports, module) {
   /**
     * modify 2013-10-09 15:41:38
     * 
     * 原QQ  在线客服QQ号码    部门  品牌  小类
    864236049   1211626552  整机  同方  笔记本电脑
    82432839    1265159594  黑电  松下  家庭影院、组合音响、蓝光DVD
    86535628    1400637929  黑电  飞利浦 高清播放器  ///~ 未找到高清播放机
    745200393   1405544371  黑电  长虹  平板电视
    1191299123  1409228148  黑电  康佳  平板电视
    47997425    1409552512  IT1 映泰  主板
    2912633081  1465293193  IT2 巴法络 路由器
    2380574301  1423214134  整机  海尔  笔记本电脑
    2869766778  1444650957  整机  惠普  笔记本电脑  ///~ 超级本小类需要改吗
        新增  1420089668  黑电  创维  平板电视
        
    1、 原号码86535628，都更改为1400637929。品类：家庭影院、蓝光DVD
    2、 原号码2869766778，都更改为1444650957。品类：笔记本电脑、超极本
        以上数据粘贴时候有误，按此为准。谢谢！

     * 
     */
    
    /**
     * modify 2013-11-06 12:08:25
     * 原QQ  新在线客服QQ号码   部门  品牌  小类  PM  备注
    1307528533  1444785246  通讯  OPPO    手机  孔令鹏 
    2742258213  1465429733  通讯  索尼  手机  孔令鹏 
    1963428312  1478569861  通讯  金立  手机  孔令鹏 
    2957672015  1480959672  空调  海信  空调  刘乃赫 原小类品牌：海信、科龙 空调
    2957672015  1493652483  空调  科龙  空调  刘乃赫 原小类品牌：海信、科龙 空调
    2742062569  1493866984  健康电器    3M  净水设备    王云红 
    2957387027  1502605237  黑电  LG  平板电视    许纹章 
    2742675624  1503630242  冰洗  奥马  冰箱  黄胜军 
    2816361677  1504424572  黑电  联想  平板电视    许纹章 
    2747026004  1513280854  冰洗  海信  冰箱  孔庆方 
    新增  1516184898  厨卫  老板  热水器、油烟机、消毒柜、烟灶套餐、灶具 夏卫东 

     * 
     */
    
    var serviceList = {
        "234":{
            "481":1211626552,//笔记本   234 同方  481 厂家提供人员  2   864236049
            //"100":1084440124,// 笔记本 234 微星  100 厂家提供人员  1   1084440124
            "396":1423214134,//笔记本  234 海尔  396 厂家提供人员  1   2380574301
            "246":1444650957//,//笔记本  234 惠普  246 厂家提供人员  2   2869766778
            //"108":133888683 //笔记本  234 三星  108 厂家提供人员  1   133888683

        },
        "72":{//超极本 72  惠普  246 厂家提供人员      2869766778
            "246": 1444650957
        },       
        "286":{//防火墙 286 H3C 267 上海吉海网络科技有限公司        2485609011
            "267": 2485609011
        },
        /**
         * 交换机  88  H3C 267 上海吉海网络科技有限公司    1   2485609011
                            交换机 88  Cisco 思科    1616    英迈电子商贸（上海）有限公司      2021559370
                            交换机 88  NETGEAR 美国网件    87  北京万恒科技有限公司      2746438328
                            交换机 88  普联  152 普联技术有限公司        2033171377

         */
        "88":{
            "267": 2485609011,
            "1616": 2021559370,
            "87": 2957720115,
            "152": 2033171377
        },
        "739":{ //净水设备   739 3M  191 上海必嘉贸易发展有限公司(小家电）   3   2742062569
            "191": 1493866984
        },
        /**
         * 空调   736 海信  747     1   617445686
                             空调  736 科龙  2341            617445686
         */
        "736":{
            "747": 1480959672,
            "2341": 1493652483
        },
        /**
         *  路由器  270 H3C 267 上海吉海网络科技有限公司        2485609011
                                路由器 270 磊科  262 深圳市磊科实业有限公司 1   1926626842
                                路由器 270 Cisco 思科    1616    英迈电子商贸（上海）有限公司  1   2021559370
                                路由器 270 D-Link  85  友讯网络    1   2033705264
                                路由器 270 Tenda 腾达    963 深圳市吉祥腾达科技有限公司   1   2562603519
                                路由器 270 NETGEAR 美国网件    87  北京万恒科技有限公司  1   2746438328
                                路由器 270 巴法络 91  上海思曙信息科技有限公司    1   2355833077
                                路由器 270 普联  152 普联技术有限公司    1   2033171377

         */
        "270":{
            "267": 2485609011,
            "262": 1926626842,
            "1616": 2021559370,
            "85": 2033705264,
            "963": 2562603519,
            "87": 2957720115,
            "91": 1465293193,
            "152": 2033171377
        },
        /**
         *  平板电视 386 海信  747 青岛海信电器股份有限公司    2   1840538654
                                平板电视    386 长虹  14      1   745200393
                                平板电视    386 康佳  118     1   1191299123
                                平板电视    386 LG  160     1   760256087
                                平板电视    386 三洋  70      1   1582736548
                                平板电视    386 联想  218     1   9454815766
                                平板电视    386 TCL 423     1   2745686215

         */
        "386":{
            "747": 1840538654,
            "14": 1405544371,
            "118": 1409228148,
            "160": 1502605237,
            "70": 1582736548,
            "218": 1504424572,
            "423": 2745686215,
            "10584":2905238990, // 乐视
            "740": 1420089668 // 创微 
        },
        /**
         *  网卡   92  磊科  262 深圳市磊科实业有限公司     1926626842
                                网卡  92  Tenda 腾达    963 深圳市吉祥腾达科技有限公司       2562603519
                                网卡  92  NETGEAR 美国网件    87  北京万恒科技有限公司      2746438328
                                网卡  92  普联  152 普联技术有限公司        2033171377
         */
        "92":{
            "262": 1926626842,
            "963": 2562603519,
            "87": 2957720115,
            "152": 2033171377
        },
        /** 网络存储 "223"    色卡司 442 色卡司科技（深圳）有限公司   1   1447721792
                                网络存储    "223"    威联通 8   威联通科技（北京）有限公司   1   1724743417
                                网络存储    "223"    铁威马 1465    深圳市图美电子技术有限公司   1   2427015801
                                网络存储    "223"    群晖  3929    深圳市凯洛蜜贸易有限公司    1   2034702827
                                网络配件    "223"    D-Link  85  友翔电子技术（北京）有限公司  1   2746447713
          */
        "223":{
            "442": 1447721792,
            "8": 1724743417,
            //"1465": 2427015801,
            "3929": 2034702827,
            "85": 2746447713
        },
        /**
         * 网络配件    "258"    D-Link  85  友翔电子技术（北京）有限公司  1   2746447713
         */
        "258":{
            "85": 2746447713
        },
        /**
         * 洗碗机  1564    方太  2380    宁波方太营销有限公司      2806839490
         */
        "1564":{
            "2380": 2806839490,
            "3010": 2033428533
        },
        /**
         * 显卡   166 微星  100 微优商贸（深圳）有限公司（工厂）    1   47829464
                              显卡  166 铭瑄  151 上海天喜电脑有限公司（工厂）  1   328395778
         */
        "166":{
            //"100": 47829464,
            //"151": 328395778
        },
        /**
         * 消毒柜  800 方太  2380    宁波方太营销有限公司      2806839490
         *          华帝  3010      中山华帝燃具股份有限公司        2033428533
         */
        "800":{
            "2380": 2806839490,
            "3010": 2033428533,
            "2281": 1516184898
        },
        /**
         * 烟灶套餐 1902    方太  2380    宁波方太营销有限公司  2   2806839490
         */
        "1902":{
            "2380": 2806839490,
            "3010": 2033428533,
            "2281": 1516184898
        },
        /**
         * 油烟机  1881    方太  2380    宁波方太营销有限公司      2806839490
         */
        "1881":{
            "2380": 2806839490,
            "3010": 2033428533,
            "2281": 1516184898
        },
        /**
         * 灶具   1901    方太  2380    宁波方太营销有限公司      2806839490
         */
        "1901":{
            "2380": 2806839490,
            "3010": 2033428533,
            "2281": 1516184898
        },
        /**
         *  主板   152 华硕  124 华硕电脑（上海）有限公司（工厂）    1   195342145
                                主板  152 微星  100 微优商贸（深圳）有限公司（工厂）    1   47829464
                                主板  152 华擎  126 威健国际贸易（上海）有限公司深圳分公司（总代） 1   2746671127
                                主板  152 映泰  132 深圳市映德电子科技有限公司（工厂）   2   47997425
                                主板  152 七彩虹 133 深圳市七彩虹科技发展有限公司（工厂）  1   727234613
                                主板  152 梅捷  167 上海天喜电脑有限公司（工厂）  1   417363840
         */
        "152":{
            //"124": 195342145,
            //"100": 47829464,
            "126": 2746671127,
            "132": 1409552512,
            //"133": 727234613,
            "167": 417363840
        },
        /**
         * 冰箱   737 海信      海信科龙电器股份有限公司    1   2747026004
                        冰箱      容声      海信科龙电器股份有限公司    1   2742348613
                        冰箱      奥马      广东奥马电器股份有限公司    3   2742675624
         */
        "737":{
            "747": 1513280854,
            "1157": 2742348613,
            "3279": 1503630242
        },
        /**
         *电炖锅   453 小熊  812         2355600920
         */
        
        "453":{
            "812": 2355600920
        },
        //电炖锅   453 小熊  812         2355600920
        "743":{
            "812": 2355600920
        },
        /**
         * 高清播放机    347 天敏  243         2741576260
                        高清播放机       美如画 1112            2496658497
                        高清播放机       乐视  10584           2905238990
                        高清播放机       开博尔 2319            2355615231
                        //高清播放机       海信              1840538654
                        高清播放机       海美迪 1667            2941821481
                        高清播放机       Dbstar  11136           2735985104
         */
        "347":{
            "243":2741576260,
            "1112":2496658497,
            "10584":2905238990,
            //"2319":2355615231,
            "747":1840538654,
            "1667":2941821481,
            "11136":2735985104
        },
        /**
         * 家庭影院 467 雅马哈     780     2332639583
                            家庭影院        先锋      157     2332639583
                            家庭影院        天龙      1306        1637894815
                            家庭影院        松下      18      82432839
                            家庭影院        马兰士     3486        1637894815
                            家庭影院        飞利浦     63      86535628
                            家庭影院        波士顿声学       10359       1637894815
         */
        "467":{
            "780":2332639583,
            "157":2332639583,
            "1306":1637894815,
            "18":1265159594,
            "3486":1637894815,
            "63":1400637929,
            "10359":1637894815
        },
        /**
         * 蓝光DVD    745 雅马哈 780         2332639583
                        蓝光DVD       先锋  157         2332639583
                        蓝光DVD       天龙  1306            1637894815
                        蓝光DVD       松下  18          82432839
                        蓝光DVD       马兰士 3486            1637894815
                        蓝光DVD       飞利浦 63          86535628

         */
        "745":{
            "780":2332639583,
            "157":2332639583,
            "1306":1637894815,
            "18":1265159594,
            "3486":1637894815,
            "63":1400637929
        },
        /**
         * 组合音响 594 雅马哈             2332639583  
                        组合音响        先锋              2332639583  
                        组合音响        天龙              1637894815  
                        组合音响        松下              82432839    
                        组合音响        马兰士             1637894815  
                        组合音响        波士顿声学               1637894815  
         */
        "594":{
            "780":2332639583,
            "157":2332639583,
            "1306":1637894815,
            "18":1265159594,
            "3486":1637894815,
            "10359":1637894815
        },
        /**
         * 酸奶机  670 小熊  812     1   2355600920
         */
        "670":{
            "812":2355600920
        },
        /**
         * 煮蛋器   461 小熊  812         2355600920
         */
        "461":{
            "812":2355600920
        },
        // SKG 电磁炉
        "455":{
            "887": 443580428
        },
        //skg电烤箱
        "451":{
            "887": 443580428
        },
        // skg 榨汁机
        "836":{
            "887": 443580428
        },
        // skg 电水壶
        "459":{
            "887": 443580428
        },
        /**
         * 创意电器     1176    小熊  812         2355600920
         * skg 创意电器
         */ 
        "1176":{
            "812": 2355600920
        },
        //skg面包机
        "1179":{
            "887": 443580428
        },
        // 收音收录 747 天敏  243         2741576260
        "747":{
            "243":2741576260
        },
        /**
         * 1444785246   通讯  OPPO    手机
         * 1465429733   通讯  索尼  手机
           1478569861  通讯  金立  手机
         */
        "311":{
            "222": 1444785246,
            "107": 1465429733,
            "3617": 1478569861
        },
        "838":{
            "2281": 1516184898
        }
        
    };
    
    function init(){
        itemInfo.have_wpa = 0;
        var oCategory = serviceList[itemInfo.c3ids];
        if(oCategory){
            var oBrand = oCategory[itemInfo.brand_no];
            if(oBrand){
                var shtml = [
                    '<li class="xguide_row xguide_cs">',
                    '<div class="xguide_tit">客服咨询</div><div class="xguide_con">',
                    '<a target="_blank" href="http://crm2.paipai.com/cgi-bin/crmworkgroup/startsession?bizuin='+oBrand+'&groupid=1">',
                    '<img src="http://crm2.paipai.com/cgi-bin/crmworkgroup/onlinestatus?bizuin='+oBrand+'&groupid=0" alt="点击这里给我发消息" />',
                    '</a></div></li>',
    
                ].join("");
                $(".xextend ul.xguide").prepend(shtml);
                itemInfo.have_wpa = 1;
            }
        }
        
        //itemInfo.selleruin = 2795171778;
        //itemInfo.product_sale_model = 5;
        var selleruin = itemInfo.selleruin;
        if(itemInfo.product_sale_model == 5 && selleruin){
            
            var wpa_url = 'http://wpa.yixun.com/getwpasig?callback=wpakeyCallback&uin='+selleruin+ '&dealid='+ itemInfo.pid + "&sceneid=" + 2 + "&groupid=" + 0;
            window.wpakeyCallback = function(data){
                if(data.SigTencent && data.SigUi){
                    var start_session_url = "tencent://message/?uin=" + selleruin + "&fromuserid=no&touserid=no&unionid=72000106&WebSiteName=易迅网&Service=19&sigT=" + data.SigTencent + "&sigU=" + data.SigUi;
                    var shtml = [
                        '<li class="xguide_row xguide_cs">',
                        '<div class="xguide_tit">客服咨询</div><div class="xguide_con">',
                        '<a href="'+start_session_url+'">',
                        '<img src="http://wpa.paipai.com/pa?p=1:'+selleruin+':18" alt="点击这里给我发消息" />',
                        '</a></div></li>',
        
                    ].join("");
                    $(".xextend ul.xguide").prepend(shtml);
                }
                window.wpakeyCallback = null;
            }
            $.getScript(wpa_url);
            
        }
        serviceList = null;
        
        //联营商品显示地址与联系方式
        if(parseInt(itemInfo.nonsense,10) == 1){
            $.ajax({
                url:"http://d.item.yixun.com/p/merchants/info",
                dataType : 'jsonp',
                data : {cid:itemInfo.selleruin},
                cache:true,
                report: "errno",
                success: function(o){
                    if(o.errno == 0){
                        var shtml = [];
                        if(o.address){
                            shtml.push('<div class="xbrand_row"><div class="xbrand_tit">商家地址：</div><div class="xbrand_con" itemprop="address">'+o.address+'</div></div>');
                        }
                        if(o.phone){
                            shtml.push('<div class="xbrand_row"><div class="xbrand_tit">联系电话：</div><div class="xbrand_con"><p itemprop="tel">'+o.phone+'</p></div></div>');
                        }
                        $(".xextend .xbrand").append(shtml.join(""));
                    }
                }
            });
        }
    }
    
    $(document).bind('init', init);
});/*  |xGv00|b3d1f66f2b3614d973d12d7f76baa5f9 */